import { useSelector } from 'react-redux';
import { useDispatch } from 'react-redux';
import { Button } from '@consta/uikit/Button';
import { CollectValuesAction } from '../../store/actions';
import OP from 'object-path';
import './style.css';
import React from 'react';

function Export2Word(element, filename = '') {
    var preHtml =
        "<html xmlns:o='urn:schemas-microsoft-com:office:office' xmlns:w='urn:schemas-microsoft-com:office:word' xmlns='http://www.w3.org/TR/REC-html40'><head><meta charset='utf-8'><title>Export HTML To Doc</title></head><body>";
    var postHtml = '</body></html>';
    var css = ('\
   <style>\
   @page WordSection1{size: 841.95pt 595.35pt;mso-page-orientation: portrait;}\
   div.WordSection1 {page: WordSection1;}\
   h1 {font-family: "Times New Roman", Georgia, Serif; font-size: 16pt; color:red}\
   p {font-family: "Times New Roman", Georgia, Serif; font-size: 14pt;}\
   .rigth-wrapper { overflow: scroll;height: 100vh;padding: 15px; color:red}\
   .task-heading{text-align: center;margin-bottom: 20px;}\
   .rigth-wrapper-item > div {margin: 0px 0px 6px 0;font-size: 14px;}\
   .rigth-wrapper h2 {margin-top: 15px;}\
   .export-button {width: 200px;margin-top: 20px;}\
   .elem{display: flex;}\
   .elem h4{width: 400px;margin-right: 10px;}\
   .rigth-wrapper-item{display: flex;flex-direction: column;flex: 1;}\
   </style>\
  ');
    var html = document.getElementById('exportContent').innerHTML;
    html = '\
  <html xmlns:o="urn:schemas-microsoft-com:office:office" xmlns:w="urn:schemas-microsoft-com:office:word" xmlns="http://www.w3.org/TR/REC-html40">\
  <head>\
    <title>Document Title</title>\
    <xml>\
      <w:worddocument xmlns:w="#unknown">\
        <w:view>Print</w:view>\
        <w:zoom>90</w:zoom>\
        <w:donotoptimizeforbrowser />\
      </w:worddocument>\
    </xml>\
    <style>\
    @page WordSection1{size: 841.95pt 595.35pt;mso-page-orientation: portrait;}\
    div.WordSection1 {page: WordSection1;}\
    h1 {font-family: "Times New Roman", Georgia, Serif; font-size: 16pt;}\
    p {font-family: "Times New Roman", Georgia, Serif; font-size: 14pt;}\
    .rigth-wrapper { overflow: scroll; height: 100vh; padding: 15px;}\
    .task-heading{text-align: center; margin-bottom: 20px;}\
    .rigth-wrapper-item div{margin-top:0px; font-size: 14px;}\
    .rigth-wrapper h2 {margin-top: 15px;}\
    .export-button {width: 200px; margin-top: 20px;}\
    .elem h4{width: 400px; margin-right:400px; margin-top:0px;}\
    .sub-item{font-size:14px}\
    .rigth-wrapper-item{margin-left:200px;}\
    </style>\
  </head>\
  <body lang=RU-ru style="tab-interval:.5in">\
    <div class="Section1">' + html + '</div>\
  </body>\
  </html>'
    console.log(css, "csscsscsscss");
    var blob = new Blob(['\ufeff', css + html], {
        type: 'application/msword'
    });

    // Specify link url
    var url =
        'data:application/vnd.ms-word;charset=utf-8,' +
        encodeURIComponent(html);

    // Specify file name
    filename = filename ? filename + '.doc' : 'document.doc';

    // Create download link element
    var downloadLink = document.createElement('a');

    document.body.appendChild(downloadLink);

    if (navigator.msSaveOrOpenBlob) {
        navigator.msSaveOrOpenBlob(blob, filename);
    } else {
        // Create a link to the file
        downloadLink.href = url;

        // Setting the file name
        downloadLink.download = filename;

        //triggering the function
        downloadLink.click();
    }

    document.body.removeChild(downloadLink);
}
const RideSideComp = () => {
    const value = useSelector((state) => {
        return OP.get(state.values, 'main');
    });

    const id = useSelector((state) => {
        return OP.get(state.values, 'id1.1');
    });
    if (value.main) {
        const { main } = value;
        console.log(main, "mainmainmainmain");
        return (
            <>
                <div className="rigth-wrapper" id="exportContent">
                    <h1 className='task-heading'>ЗАДАНИЕ НА ПРОЕКТИРОВАНИЕ</h1>
                    <h1 className='task-heading'>{value.task_name}</h1>

                    <div className='elem'>
                        <h4>1․ Основание для проектирования</h4>
                        <div className="rigth-wrapper-item">
                            <div className='sub-item'>
                                1.1  Перечень приоритетных проектов на 10-летний период. {id}
                            </div>
                            <div>
                                1.2  Решения ПАО «Газпром» по обоснованиям инвестиций {main.name_of_region}
                            </div>
                            <div>
                                1.3 Комплексные целевые Программы развития и реконструкции объектов ПАО «Газпром» {main.capacity}
                            </div>
                            <div>
                                1.4 Поручение Председателя Правления, заместителя Председателя Правления ПАО «Газпром», в т.ч. протоколы совещаний {main.capacity}
                            </div>
                            <div>
                                1.5  Протокол Комиссии газовой промышленности ПАО «Газпром» по разработке месторождений и использованию недр, содержащий решение о достаточности проектного документа на разработку месторождения в качестве основания для включения затрат на разработку проекта обустройства месторождения в План капитального строительства (в раздел «План ПИР»), основанное на положительном заключении по данному вопросу заинтересованных структурных подразделений администрации ПАО «Газпром» {main.capacity}
                            </div>
                        </div>
                    </div>
                    <div className='elem'>
                        <h4>2․ Месторасположение предприятия, здания, сооружения</h4>
                        {/* <div className='cont'> */}
                        <div className="rigth-wrapper-item">
                            {main.region_district ? <div>
                                2.1 Российская Федерация, {main.region_district},{main.capacity},{main.development_regions}
                            </div> : null}
                            {main.type_of_construction ? <div>
                                2.2 Ситуационная схема (Приложение № {main.type_of_construction})
                            </div> : null}
                        </div>
                        {/* </div> */}
                    </div>
                    <div className='elem'>
                        <h4>3․ Заказчик/Агент</h4>
                        <div className="rigth-wrapper-item">
                            {main.customer_or_agent_type ? <div>
                                {main.customer_or_agent_type},{main.customer_agent_organization}
                            </div> : null}

                        </div>
                    </div>
                    <div className='elem'>
                        <h4>4․ Инвестор</h4>
                        <div className="rigth-wrapper-item">
                            <div>{main.investor_organization}</div>
                        </div>
                    </div>
                    <div className='elem'>
                        <h4>5.	Эксплуатирующая организация	</h4>
                        <div className="rigth-wrapper-item">
                            {main.company_organization}
                        </div>
                    </div>
                    <div className='elem'>
                        <h4>6.	Генеральная проектная организация (Генпроектировщик)</h4>
                        <div className="rigth-wrapper-item">
                            {main.project_organization}
                        </div>
                    </div>
                    <div className='elem'>
                        <h4>7.	Субподрядные проектные организации</h4>
                        <div className="rigth-wrapper-item">
                            <div>
                                7.1. Способ определения субподрядных организаций
                                согласовывается с ПАО «Газпром» по каждому субподрядному
                                договору в порядке, установленном внутренними
                                документами ПАО «Газпром». “
                                {main.organization_type},{main.project_organization}
                            </div>
                        </div>
                    </div>
                    <div className="elem">
                        <h4>8. Вид работ</h4>
                        <div className="rigth-wrapper-item">
                            {main.Type_of_work}
                        </div>
                    </div>
                    <div className="elem">
                        <h4>9. Источник финансирования</h4>
                        <div className="rigth-wrapper-item">
                            {main.Source_of_financing}
                        </div>
                    </div>
                    <div className="elem">
                        <h4>
                            10. Срок выполнения работы в соответствии с календарным
                            планом
                        </h4>
                        <div className="rigth-wrapper-item">
                            {main.Work_completion_time}
                        </div>
                    </div>
                    <div className="elem">
                        <h4>11. Исходные данные</h4>
                        <div className="rigth-wrapper-item">
                            <div>
                                11.1 Наименование, шифр (договор), вид предпроектной
                                документации {main.Initial_data}
                            </div>
                            <div>11.2  {main.Conclusion_results}</div>
                            <div>
                                11.3 Действующие проектные документы на разработку
                                месторождений, согласованные Комиссией газовой
                                промышленности по разработке месторождений и
                                использованию недр ПАО «Газпром»
                                {main.Current_project_documents_11_3}
                            </div>
                            <div>11.4  {main.Current_project_documents_11_4}</div>
                            <div>11.5 {main.Project_documentation}</div>
                        </div>
                    </div>
                    {main.type_documentation ? <div className="elem">
                        <h4>12. Вид документации</h4>
                        <div className="rigth-wrapper-item">
                            <div>
                                12.1. {main.type_documentation} документация.
                            </div>
                            <div>12.2. Перед разработкой проектной документации Генпроектировщику разработать
                                основные технические решения (далее – ОТР) и предоставить {main.customer_or_agent_type}</div>
                            {main.type_documentation === "Проектная"
                                ? <div>
                                    12.3.После утверждения проектной документации в установленном в ПАО «Газпром» порядке
                                    Генпроектировщику по отдельному договору разработать рабочую документацию.
                                </div>
                                : null}
                        </div>
                    </div> : null}
                    <div className="elem">
                        <h4>13. Требования к выделению этапов строительства</h4>
                        <div className="rigth-wrapper-item">
                            {main.numbers_construction_stages && main.requirements && main.requirements === "Требуется"
                                ? <div>13.1. Предусмотреть выделение следующих этапов строительства:
                                    {main.numbers_construction_stages} Необходимость выделения (дополнительных) этапов строительства
                                    определить при разработке проектной документации с уточнением их количества и состава .
                                    При определении Генпроектировщиком этапов строительства
                                    {main.customer_or_agent_type} оформить внесение изменений в задание на проектирование
                                    с учетом письма ПАО «Газпром» от 20.05.2021 № 06/44/4/06-1902.
                                </div> : <div>13.1. Не требуется.</div>}
                            {main.requirements === "Требуется" ? <div>13.2. {main.design_documentation}</div> : null}
                            {main.requirements === "Требуется" ? <div>
                                13.3.Сметную документацию разработать с выделением стоимости каждого этапа строительства.
                            </div> : null}
                        </div>
                    </div>
                    <div className="elem">
                        <h4>14. Требования по вариантной разработке</h4>
                        <div className="rigth-wrapper-item">
                            {main.number_feasibility_comparisons_performed && main.development_requirements && main.development_requirements === "Требуется"
                                ? main.develop_OTR === "Да"
                                    ? <div>14.1. Генпроектировщику на этапе ОТР обеспечить проработку оптимальных
                                        технических решений с учетом всего жизненного цикла объекта на
                                        основе результатов сравнения укрупненных технико-экономических
                                        показателей разных вариантов технико-технологических
                                        решений по видам работ:
                                        {main.number_feasibility_comparisons_performed}
                                    </div>
                                    : <div>14.1.  Генпроектировщику при разработке проектной
                                        документации обеспечить проработку оптимальных технических
                                        решений на основе результатов технико-экономических сравнений
                                        (ТЭС) показателей разных вариантов технико-технологических
                                        решений по видам работ:
                                        {main.number_feasibility_comparisons_performed}
                                    </div>
                                : <div>14.1. Не требуется.</div>}
                            {main.development_requirements === "Требуется"
                                ? <div>14.2. Достаточность, количество и необходимость
                                    выполнения технико-экономических сравнений (ТЭС) определить
                                    с учетом рекомендаций ПАО «Газпром», в т.ч. перечня ТЭС,
                                    рекомендованных ПАО «Газпром» для выполнения (письмо ПАО «Газпром»
                                    от 25.09.2020 № 06/44-4259).</div> : null}
                            {main.development_requirements === "Требуется"
                                ? <div>
                                    14.3.По результатам выполнения ТЭС вариантов технических
                                    решений Генпроектировщику разработать проектную документацию
                                    на основе выбранного и согласованного {main.customer_or_agent_type}
                                    варианта технического решения.
                                </div> : null}
                        </div>
                    </div>
                    <div className="elem">
                        <h4>15. Особые условия строительства</h4>
                        <div className="rigth-wrapper-item">
                            {main.special_construction_conditions === "Присутствуют" ? <div>
                                Опасные природные и техногенные условия, которые могут оказать неблагоприятное
                                влияние на строительство и эксплуатацию сооружений: {main.name_conditions}
                            </div> : <div>{main.special_construction_conditions}</div>}
                        </div>
                    </div>
                    <div className="elem">
                        <h4>16. Сведения об объекте капитального
                            строительства по назначению и функционально-технологическим особенностям</h4>
                        <div className="rigth-wrapper-item">
                            В проектной документации в соответствии с «Классификатором объектов капитального
                            строительства по их назначению и функционально-технологическим особенностям
                            (для целей архитектурно-строительного проектирования
                            и ведения единого государственного реестра заключений
                            экспертизы проектной документации объектов капитально го строительства)»,
                            утвержденным приказом Минстроя России от 10.07.2020 № 374/пр.
                            указать следующую информацию:
                            Группа (вид объекта капитального строительства)
                            {main.name_conditions} {main.name_conditions}
                        </div>
                    </div>
                    <div className="elem">
                        <h4>17. Идентификационные признаки и срок эксплуатации объекта</h4>
                        <div className="rigth-wrapper-item">
                            <div>
                                17.1. Генпроектировщику при разработке {main.generaldesigner_during_development}
                                — уточнить идентификационные признаки зданий и сооружений в необходимом объёме в
                                соответствии с ч. 1 ст. 4 Федерального закона от 30.12.2009
                                № 384-ФЗ «Технический регламент о безопасности зданий и сооружений»
                                и согласовать их с {main.customer_or_agent_type};
                                — указать сведения о сроках эксплуатации здания или сооружения и их частей в
                                соответствии с п. 2 ст. 33 Федерального закона от 30.12.2009 № 384-ФЗ «Технический регламент
                                о безопасности зданий и сооружений» и ГОСТ 27751-2014 «Надежность
                                строительных конструкций и оснований. Основные положения».
                            </div>
                            <div>
                                17.2. В проектной документации для зданий и сооружений,
                                предусмотренных проектом, представить сводную информацию в части идентификационных признаков
                                установленных в соответствии с требованиями ч. 1 ст.
                                4 Федерального закона от 30.12.2009 № 384-ФЗ «Технический
                                регламент о безопасности зданий и сооружений».
                            </div>
                            {main.develop_OTR === "Да" ? <div>
                                17.3. В проектной документации для зданий и сооружений,
                                предусмотренных проектом, представить сводную информацию в части идентификационных признаков
                                установленных в соответствии с требованиями ч. 1 ст.
                                4 Федерального закона от 30.12.2009 № 384-ФЗ «Технический
                                регламент о безопасности зданий и сооружений».
                            </div> : null}
                        </div>
                    </div>
                    <div className="elem">
                        <h4>18. Требование о необходимости соответствия проектной документации обоснованию
                            безопасности опасного производственного объекта</h4>
                        <div className="rigth-wrapper-item">
                            {main.requirement_need_design_documentation === "Требуется" ? <div>
                                В случае, если при проектировании опасного производственного объекта (ОПО) требуется отступление от
                                требований федеральных норм и правил в области промышленной безопасности, или этих требований не достаточно,
                                или они не установлены проектную документацию на ОПО разработать с учетом обоснования безопасности опасного
                                производственного объекта (ОБ ОПО) в соответствии
                                с п. 4 ст. 3 Федерального закона от 21.07.1997 № 116-ФЗ «О промышленной безопасности опасных производственных объектов».
                            </div> : <div>{main.requirement_need_design_documentation}</div>}
                        </div>
                    </div>
                    <div className="elem">
                        <h4>19. Требования к выполнению сбора исходных данных и инженерных изысканий для подготовки проектной документации</h4>
                        <div className="rigth-wrapper-item">
                            <div>19.1
                                Выполнить сбор исходных данных (этап 2) для проектирования в соответствии с «Инструкцией по организации и проведению сбора
                                исходных данных для строительства и реконструкции объектов ПАО «Газпром», утвержденной распоряжением ПАО «Газпром»
                                от 22.05.2018 № 95 с учетом актуальных изменений и дополнений, и заданием на сбор исходных данных, разработанным и
                                утвержденным {main.customer_or_agent_type} и согласованным Генпроектировщиком.
                            </div>
                            <div>19.2. Генпроектировщику подготовить и представить в адрес {main.customer_or_agent_type} для согласования материалы,
                                обосновывающие внесение сведений об объекте проектирования в документы территориального планирования соответствующего
                                уровня (федеральный, субъект Российской Федерации, муниципальное образование). В случае изменения наименования,
                                местоположения и основных характеристик объекта обеспечить
                                направление {main.customer_or_agent_type} соответствующих изменений.
                            </div>
                            {main.object_criteria_federal_transport_facilities === "Да"
                                ? <div>19.3. {main.customer_or_agent_type} представить в Департамент ПАО «Газпром»
                                    (А.С. Фик) материалы, обосновывающие внесение сведений об объекте проектирования в схему
                                    территориального планирования Российской Федерации
                                    в области федерального транспорта (в части трубопроводного транспорта)
                                </div> : null}
                            {main.performing_engineering_surveys === "Не требуется"
                                ? <div>19.3. Выполнение инженерных изысканий не требуется.</div> : null}
                            <div>
                                19.5. Генпроектировщику при участии {main.customer_or_agent_type}
                                до начала инженерных изысканий выполнить рекогносцировочное обследование участка под размещение объекта
                                с выдачей заключения о возможности использования материалов изысканий прошлых лет.
                            </div>
                            <div>
                                19.6. Генпроектировщику выполнить: — разработку и согласование с {main.customer_or_agent_type}
                                «Программы инженерных изысканий» и комплексного графика выполнения инженерных изысканий. При разработке
                                «Программы инженерных изысканий» учитывать заключение о возможности использования материалов изысканий
                                прошлых лет, а также полученные на предпроектной стадии результаты рекогносцировочных обследований и инженерных изысканий (при наличии);
                                — основные виды инженерных изысканий: инженерно-геодезические, инженерно-геологические (в т.ч. геофизические
                                исследования), инженерно-гидрометеорологические, инженерно-экологические и, при необходимости, специальные
                                виды инженерных изысканий в объеме, необходимом и достаточном для разработки {main.type_documentation ? main.type_documentation : ""}
                                документации в соответствии с требованиями постановления Правительства Российской Федерации от 19.01.2006 № 20
                                «Об инженерных изысканиях для подготовки проектной документации, строительства, реконструкции объектов капитального строительства»,
                                СП 47.13330.2016 «СНиП 11-02-96 Инженерные изыскания для строительства. Основные положения» и задания на инженерные изыскания,
                                разработанного и утвержденного {main.customer_or_agent_type} и согласованного Генпроектировщиком в объеме
                                необходимом и достаточном для разработки {main.type_documentation ? main.type_documentation : ""} документации
                            </div>
                            <div>
                                19.7. В случаях, предусмотренных законодательством Российской Федерации и требованиями нормативных документов,
                                выполнить следующие работы: сейсмическое микрорайонирование; работы по выявлению и изучению объектов
                                культурного наследия; поиск, обследование территории на наличие взрывоопасных предметов в местах боевых
                                действий и на территориях бывших воинских формирований.
                            </div>
                            <div>
                                19.8. Представить (при необходимости) заключение историко-культурной экспертизы или данные уполномоченного органа
                                об отсутствии объектов культурного наследия, либо объектов, обладающих признаками объекта культурного наследия в
                                соответствии с требованиями ст. 3 и ст. 30 Федерального закона от 25.06.2002 № 73-ФЗ «Об объектах культурного
                                наследия (памятниках истории и культуры) народов Российской Федерации».
                            </div>
                            <div>
                                19.9. Картографический материал должен быть получен официальным путем с соблюдением законодательства об
                                авторских правах и содержать ссылки на источник получения. При наличии на исходных материалах грифов
                                ограниченного пользования, документация должна быть оформлена в соответствии с требованиями к оформлению
                                документации ограниченного использования.
                            </div>
                        </div>
                    </div>
                    <div className="elem">
                        <h4>20. Требования к составу проектной документации, в том числе требования о разработке разделов проектной
                            документации, наличие которых не является обязательным</h4>
                        <div className="rigth-wrapper-item">
                            <div>
                                20.1. Состав ОТР (в случае разработки) и проектной документации сформировать в соответствии с функциональным
                                назначением и характерными признаками объекта проектирования, как для объектов капитального строительства
                                производственного и непроизводственного назначения {main.composition_site_linear_facilities}
                                капитального строительства.
                            </div>
                            {main.develop_OTR ? <div>
                                20.2. Состав и содержание разделов ОТР сформировать в соответствии требованиями СТО Газпром 2-1.12-434-2010
                                «Инструкция о составе, порядке разработки, согласования и утверждения проектно-сметной документации на строительство
                                зданий и сооружений ОАО «Газпром».
                            </div> : null}
                            {main.develop_OTR ? <div>  20.3. В составе ОТР разработать решения по системам безопасности. {main.type_documentation ? main.type_documentation : ""}
                                согласовать полный комплект ОТР со службой корпоративной защиты эксплуатирующей организации.
                                Согласование со Службой корпоративной защиты ПАО «Газпром» обеспечить в установленном порядке.</div> : null}
                            <div>
                                20.4. Состав и содержание разделов проектной документации сформировать в соответствии с «Положением о
                                составе разделов проектной документации и требованиях к их содержанию», утвержденным постановлением
                                Правительства Российской Федерации от 16.02.2008 № 87 (далее по тексту – Постановление № 87), с учетом
                                актуальных изменений и дополнений на момент передачи {main.customer_or_agent_type} {main.time_transfer_customer_agent}
                                В случае внесения изменений в Постановление № 87 и/или иные нормативные акты, которые могут повлиять на разработку
                                проектной документации, {main.customer_or_agent_type} необходимо согласовать с
                                Департаментом ПАО «Газпром» внесение соответствующих изменений в Задание на проектирование, для
                                последующего заключения дополнительного соглашения к договору на выполнение ПИР, с целью реализации
                                этих изменений в проектной документации.
                            </div>
                            <div>
                                20.5. В проектной документации разработать следующие разделы, содержащие инженерно-технические решения и (или) мероприятия:
                                <ol>
                                    <li>
                                        «Мероприятия по ликвидации возможных аварий при строительстве и эксплуатации опасных производственных объектов» (МЛА).
                                    </li>
                                    <li>
                                        «План мероприятий по локализации и ликвидации последствий аварий» (ПМЛА) в соответствии с требованиями:
                                        «Положения о разработке планов мероприятий по локализации и ликвидации последствий аварий на опасных
                                        производственных объектах», утвержденного постановлением Правительства Российской Федерации от 15.09.2020 № 1437;
                                        Приложения № 1 к ФНП «Правила безопасности в нефтяной и газовой промышленности», утвержденных приказом Ростехнадзора от 15.12.2020 № 534.
                                        Перечень ПМЛА согласовать с {main.customer_or_agent_type}.
                                        (выполняется по согласованию с Заказчиком/Агентом при разработке проектной документации на вновь создаваемые объекты, зарегистрированные в государственном реестре опасных производственных объектов)
                                    </li>
                                    {main.time_transfer_customer_agent === 'Требуется разработать'
                                        ? <li>«Структурированная система мониторинга и управления инженерными системами зданий и сооружений» (СМИС).
                                            (указывается при необходимости разработки)</li>
                                        : null}
                                    {main.measures_maintenance_repair_equipment === "Требуется разработать"
                                        ? <li>«Мероприятия по техническому обслуживанию и ремонту оборудования» (ТОР). (указывается при необходимости разработки)</li>
                                        : null
                                    }
                                    {main.measures_counter_terrorism === "Требуется разработать"
                                        ? <li>«Мероприятия по противодействию терроризму» (МПТ). (указывается при необходимости разработки)</li>
                                        : null
                                    }
                                </ol>
                                {main.other_sections}
                                (Заказчику/Агенту в зависимости от назначения объекта капитального строительства и вида работ перечислить разделы, которые необходимо разработать в дополнение к обязательным
                                разделам, установленным Постановлением № 87, за исключением разделов, которые включены в соответствующие разделы задания на проектирование)

                            </div>
                        </div>
                    </div>
                    <div className="elem">
                        <h4>21. Порядок разработки документации</h4>
                        <div className="rigth-wrapper-item">
                            <div>
                                <ol>
                                    <div className='number_li'>21.<li>
                                        Проектную документацию разработать в соответствии с требованиями действующих технических регламентов,
                                        законодательных и нормативных правовых актов Российской Федерации, нормативных документов федеральных органов
                                        исполнительной власти и стандартами ПАО «Газпром» (в редакции, действующей на момент передачи проектной
                                        документации {main.customer_or_agent_type} до проведения государственной экспертизы), содержащих установленные требования.
                                    </li></div>
                                    {main.type_documentation && main.type_documentation === "Проектная и рабочая"
                                        ? <div className='number_li'>21.<li>
                                            Проектную документацию разработать в соответствии с требованиями действующих технических регламентов,
                                            законодательных и нормативных правовых актов Российской Федерации, нормативных документов федеральных органов
                                            исполнительной власти и стандартами ПАО «Газпром» (в редакции, действующей на момент передачи проектной
                                            документации {main.customer_or_agent_type} до проведения государственной экспертизы), содержащих установленные требования.
                                        </li>
                                            <div className='number_li'>21.<li>
                                                В случае изменения требований нормативных документов на момент разработки рабочей документации,
                                                по решению {main.customer_or_agent_type}, разработку рабочей документации
                                                осуществить в соответствии с требованиями действующих нормативных документов, а также внести
                                                соответствующие изменения в проектную документацию в рамках отдельного договора.
                                            </li></div>
                                            <div className='number_li'>21.<li>
                                                При повторной экспертизе (экспертном сопровождении) обеспечить сопровождение проектной документации,
                                                в которую были внесены изменения для случаев, не предусмотренных ч. 3.8 ст. 49 Федерального закона от
                                                29.12.2004 № 190-ФЗ «Градостроительного кодекса Российской Федерации».
                                            </li>
                                            </div>
                                        </div>
                                        : null}
                                    <div className='number_li'>21.<li>
                                        Оформление {main.type_documentation} документации выполнить в соответствии с требованиями
                                        ГОСТ Р 21.101-2020 «Основные требования к проектной и рабочей документации»,
                                        СТО Газпром 2-1.12-434-2010.
                                    </li></div>
                                    <div className='number_li'>21.<li>
                                        При разработке проектной документации выполнить формирование и классификацию структуры проекта
                                        (перечень объектов капитального строительства и объектов сводного сметного расчета) в соответствии
                                        с требованиями «Методических указаний по формированию структуры проекта», утвержденных ПАО «Газпром»
                                        от 18.07.2017 № 03/36-4703. Структуру проекта согласовать с {main.customer_or_agent_type}.
                                        Обеспечить соблюдение преемственности структуры проекта на этапе разработки проектной документации с решениями,
                                        определенными в предпроектной документации, а также в рабочей документации.
                                    </li></div>
                                    <div className='number_li'>21.<li>
                                        При разработке ОТР сформировать предварительную структуру проекта (перечень объектов капитального
                                        строительства и элементов их иерархии) в соответствии с требованиями «Методических указаний по
                                        формированию структуры проекта», утвержденных ПАО «Газпром» от 18.07.2017 № 03/36-4703.
                                    </li></div>
                                    <div className='number_li'>21.<li>
                                        В раздел 1 «Пояснительная записка» проектной документации в текстовую часть включить раздел «Применение
                                        инновационной продукции», в котором представить сводную информацию об использовании в проекте
                                        инновационной и высокотехнологичной продукции в соответствии с Положением о внедрении в ПАО «Газпром»
                                        инновационной продукции, в том числе результатов научно-исследовательских, опытно-конструкторских и
                                        технологических работ, утвержденным приказом от 02.03.2018 № 102. Сведения (перечень) отразить с
                                        указанием количественных, стоимостных показателей со ссылкой на соответствующие номера томов проектной
                                        документации с выделением продукции, включенной в Реестр инновационной продукции для
                                        внедрения в ПАО «Газпром».
                                    </li></div>
                                    <div className='number_li'>21.<li>
                                        В начале каждого разрабатываемого раздела проектной документации следует представлять перечень
                                        нормативной правовой и нормативно-технической документации, которой руководствовались при его
                                        разработке, в случае если иное не предусмотрено нормативными документами.
                                    </li></div>
                                    <div className='number_li'>21.<li>
                                        В рабочей документации разработать сборник ведомостей объемов работ.
                                    </li></div>
                                    {main.type_documentation === "Проектная и рабочая" ? <div className='number_li'>21.<li>
                                        В рабочей документации разработать сборник ведомостей объемов работ.
                                    </li>
                                    </div> : null}
                                    (пункт применяется только при условии размещения объекта проектирования в Арктической зоне Российской Федерации)
                                    {main.composition_site_linear_facilities === "Да" ? <div className='number_li'>21.<li>
                                        Обеспечить исполнение требований Федерального закона от 13.07.2020 № 194-ФЗ «О внесении изменений в отдельные
                                        законодательные акты Российской Федерации в связи с принятием Федерального закона «О государственной поддержке
                                        предпринимательской деятельности в Арктической зоне Российской Федерации» о прохождении государственной
                                        экологической экспертизы проектной документации объектов капитального строительства, строительство,
                                        реконструкцию которых предполагается осуществлять в Арктической зоне Российской Федерации.
                                    </li>
                                    </div> : null}
                                </ol>
                            </div>
                        </div>

                    </div>
                    <div className="elem">
                        <h4>22. Основные технико-экономические характеристики и показатели объекта</h4>
                        <div className="rigth-wrapper-item">
                            <div>
                                <ol>
                                    <div className='number_li'>22.<li>
                                        Основные технико-экономические показатели определить в проектной документации.</li>
                                    </div>
                                    {main.technical_indicators_determined_project_documentation
                                        ? <div className='number_li'>22.<li>
                                            Основные технико-стоимостные показатели определить в проектной документации. </li>
                                        </div> : null}
                                    {main.technical_economic_part ? <div className='number_li'>22.<li>
                                        В проектной документации определить эффективность инвестиций. Разработать раздел
                                        «Технико-экономическая часть. Оценка эффективности инвестиций».</li>
                                    </div> : null}
                                    <div className='number_li'>22.<li>
                                        Эффективность инвестиций, включая показатели экономической эффективности проекта,
                                        определить в соответствии с «Методическими рекомендациями по оценке эффективности
                                        инвестиционных проектов» (вторая редакция, 2000 г.), утвержденными Минэкономики России,
                                        Минфином России, Госстроем России (от 21.06.1999 № ВК477), и «Методикой оценки экономической
                                        эффективности инвестиционных проектов в форме капитальных вложений», утвержденной
                                        ОАО «Газпром» (от 09.09.2009 № 01/07-99).</li>
                                    </div>
                                    <div className='number_li'>22.<li>
                                        В случае выделения нескольких этапов строительства при разработке проектной документации по
                                        каждому этапу выполнить сводку затрат по форме приложения к Методике. При разработке нескольких
                                        комплектов проектной документации выполнить оценку эффективности инвестиций в рамках каждого
                                        комплекта проектной документации в отдельности и консолидированный расчет эффективности инвестиций
                                        по всем этапам строительства при разработке последнего комплекта проектной документации.</li>
                                    </div>
                                    <div className='number_li'>22.<li>
                                        В составе раздела «Технико-экономическая часть. Оценка эффективности инвестиций» рассчитать и в
                                        текстовой его части в разделе «Технико-экономические показатели» представить результаты расчетов
                                        следующих основных показателей экономической эффективности проекта:<br />
                                        чистый доход (млн. руб.);<br />
                                        чистый дисконтированный доход (млн. руб.);<br />
                                        внутренняя норма доходности (%);<br />
                                        недисконтированный срок окупаемости (лет);<br />
                                        дисконтированный срок окупаемости (лет);<br />
                                        индекс доходности дисконтированных инвестиций (ед.);<br />
                                        индекс доходности недисконтированный (ед.);<br />
                                        уровень цен расчета показателей экономической эффективности (год);<br />
                                        норма дисконта (%).
                                    </li>
                                    </div>
                                    <div className='number_li'>22.<li>
                                        При выполнении раздела «Технико-экономическая часть. Оценка эффективности инвестиций»
                                        принять в качестве условий: расчеты выполнить в постоянных в ценах по состоянию на 1 января
                                        года выполнения работы без учета инфляции; шаг расчета – 1 год;
                                    </li>
                                    </div>
                                    <div className='number_li'>22.<li>
                                        При выполнении раздела «Технико-экономическая часть. Оценка эффективности инвестиций»
                                        принять в качестве условий: расчеты выполнить в постоянных в ценах по состоянию на 1 января
                                        года выполнения работы без учета инфляции;<br /> шаг расчета – 1 год;<br />
                                        ставка дисконтирования – 10%, год приведения соответствует году, в ценах которого выполняется расчет;<br />
                                        валюта расчета – рубль Российская Федерация.
                                    </li>
                                    </div>
                                    <div className='number_li'>22.<li>
                                        В составе проектных материалов раздела «Технико-экономическая часть. Оценка эффективности
                                        инвестиций» представить на экспертизу расчетную финансово-экономическую модель проекта,
                                        выполненную в электронном виде. Модель должна быть рабочей, т.е. содержать исходные данные
                                        и формулы, позволяющие при необходимости внесения в нее изменений осуществить пересчет
                                        экономических показателей проекта.
                                    </li></div>
                                </ol>
                            </div>
                        </div>
                    </div>
                    <div className="elem">
                        <h4>23. Требования к подготовке сметной документации</h4>
                        <div className="rigth-wrapper-item">
                            <div>
                                <ol>
                                    <div className='number_li'>23.<li>
                                        На основании п. 5.1 «Регламента формирования и реализации Инвестиционных программ ПАО «Газпром»,
                                        утвержденного приказом ПАО «Газпром» от 30.12.2020 № 548, учесть затраты на мониторинг соответствия
                                        стоимостных параметров в составе главы 12 «Проектные и изыскательские работы» ССР в соответствии с
                                        письмом ПАО «Газпром» от 02.12.2016 № 03/36-8347, п.12.8 Приложения № 2 к письму ПАО «Газпром» от
                                        05.02.2019 № 03-176 с учетом письма ОАО «Газпром» от 20.12.2014 № 03/11/2-4365.</li>
                                    </div>
                                    <div className='number_li'>23.<li>
                                        Сметная документация разрабатывается в соответствии с подразделом Требования к разработке сметной
                                        документации в составе {main.type_documentation}
                                        технических требований на проектирование (Приложение № 1).</li>
                                    </div>
                                    <div className='number_li'>23.<li>
                                        При разработке сметной документации обеспечить выполнение требований актуального на момент разработки проектной
                                        документации приказа ПАО «Газпром» «О мерах по повышению операционной эффективности и сокращению расходов ПАО «Газпром».</li>
                                    </div>
                                    <div className='number_li'>23.<li>
                                        В составе сметной документации сформировать отдельным томом Реестр разработанной сметной документации
                                        в соответствии с «Методическими рекомендациями по обозначению сметной документации в соответствии
                                        с требованиями по классификации и кодированию объектов капитального строительства и элементов их
                                        иерархии», утвержденными ПАО «Газпром» (от 03.02.2017 № 03/36/1-679), с учетом актуальных изменений
                                        и дополнений, выполненный в электронном формате.</li>
                                    </div>
                                    <div className='number_li'>23.<li>
                                        Генпроектировщику обеспечить включение в состав сметной документации (в главе 12 сводного сметного расчета)
                                        затрат, понесенных на выполнение предпроектной документации (при наличии). {main.customer_or_agent_type}
                                        направлять соответствующую информацию Генпроектировщику и контролировать её включение в состав сметной документации.</li>
                                    </div>
                                </ol>
                            </div>
                        </div>
                    </div>
                    <div className="elem">
                        <h4>24. Особые требования к проектированию</h4>
                        <div className="rigth-wrapper-item">
                            <div>
                                <ol>
                                    <div className='number_li'>24.<li>Выполнить экспертизу патентной чистоты объекта проектирования
                                        в целом и принимаемых в проектной документации технических решений, планируемых к использованию
                                        на этапах его реализации и эксплуатации.</li>
                                    </div>
                                    <div className='number_li'>24.<li>Экспертизу патентной чистоты выполнить в соответствии с требованиями ГОСТ
                                        Р 15.011-96 «Система разработки и постановка продукции на производство. Патентные исследования.
                                        Содержание и порядок проведения» в отношении страны реализации объекта проектирования.</li>
                                    </div>
                                    <div className='number_li'>24.<li> В соответствующем разделе отчета экспертизы патентной чистоты
                                        указать требование о необходимости наличия в составе сопроводительной документации на все виды
                                        поставляемых изделий, материалов и оборудования патентных формуляров, оформленных в соответствии
                                        с требованиями ГОСТ 15.012-84 «Система разработки и постановки продукции на производство.
                                        Патентный формуляр».</li>
                                    </div>
                                    <div className='number_li'>24.<li>Работы по экспертизе патентной чистоты выполнить по отдельному договору. </li>
                                    </div>
                                    <div className='number_li'>24.<li> Обеспечить соответствие применяемых технологий, относящихся к областям применения
                                        наилучших доступных технологий, требованиям отраслевых справочников, создаваемых в соответствии с Распоряжением
                                        Правительства Российской Федерации от 31.10.2014 № 2178-р. Учесть положения «Реестра наилучших доступных технологий,
                                        обеспечивающих экологически безопасное освоение, подготовку, транспортировку, хранение и переработку углеводородного
                                        сырья ОАО «Газпром», утвержденного ОАО «Газпром» 17.11.2014.</li>
                                    </div>
                                    <div className='number_li'>24.<li> Интенсивность сейсмических воздействий в баллах (фоновую сейсмичность)
                                        для района строительства принять в соответствии с СП 14.13330.2018 «Строительство в сейсмических
                                        районах» на основе комплекта карт общего сейсмического районирования территории Российской Федерации
                                        (с учетом актуальных изменений).</li>
                                    </div>
                                    <div className='number_li'>24.<li> Значения коэффициента, учитывающего назначение сооружения и его ответственность, К0 принять
                                        в соответствии с СП 14.13330.2018 (с учетом актуальных изменений).</li>
                                    </div>
                                    <div className='number_li'>24.<li>  Значения коэффициента, учитывающего допускаемые повреждения проектируемых зданий и
                                        сооружений при определении расчетной сейсмической нагрузки, K1 принять в соответствии с СП 14.13330.2018
                                        (с учетом актуальных изменений).</li>
                                    </div>
                                    <div className='number_li'>24.<li>  Общество {main.developer_name}, являющееся застройщиком
                                        (техническим заказчиком), декларирует  отнесение проектируемых объектов к
                                        объектам {main.object_category} категории, оказывающим негативное воздействие на окружающую среду,
                                        в соответствии с подпунктом {main.subparagraph_number_Criteria_assigning_objects} пункта {main.item_number_Criteria_assigning_objects}
                                        «Критериев отнесения объектов,
                                        оказывающих негативное воздействие на окружающую среду, к объектам I, II, III и IV категорий», утвержденных постановлением
                                        Правительства Российской Федерации от 31.12.2020 № 2398.(пункт применяется для объектов нового
                                        строительства и для объектов реконструкции в случае изменения категории действующего производства)
                                    </li>
                                    </div>
                                    <div className='number_li'>24.<li> Исходные данные от потенциальной генеральной подрядной организации,
                                        которые необходимы для формирования раздела «Проект организации строительства» и сметной
                                        части проектной документации, предоставляет {main.customer_or_agent_type}
                                        по соответствующему запросу Генпроектировщика.<br />
                                        (исходные данные потенциальной генеральной организации, возможно, использовать только при наличии
                                        соответствующего решения Инвестора о ее назначении)
                                    </li>
                                    </div>
                                    <div className='number_li'>24.<li>  При разработке схемы логистического обеспечения «Проекта организации
                                        строительства» для хранения МТР ПАО «Газпром» необходимо предусмотреть максимально возможное
                                        использование складских мощностей дочерних обществ ПАО «Газпром», находящихся в границах
                                        транспортной схемы. В случае отказа дочерних обществ ПАО «Газпром» в представлении складских
                                        мощностей представлять подтверждающие документы, в соответствии с поручением Председателя
                                        Правления ПАО «Газпром» А.Б. Миллера от 04.06.2019 № 01-2118.
                                    </li>
                                    </div>
                                    <div className='number_li'>24.<li>  В составе проектной документации в Разделе 12 «Иная документация»
                                        разработать отдельный том «Проект календарно-сетевого графика реализации инвестиционного проекта» с
                                        детализацией мероприятий на стадиях «Проектирование» и «Строительство» до 2-го уровня планирования.
                                        Структуру проекта календарно-сетевого графика принять в соответствии с требованиями распоряжения
                                        ПАО «Газпром» от 15.03.2021 № 83 с учетом письма ПАО «Газпром» от 13.05.2021 № 06/44-2370.
                                    </li>
                                    </div>
                                    <div className='number_li'>24.<li> Исключить прямое применение международных и региональных
                                        стандартов, национальных стандартов зарубежных стран, стандартов сторонних организаций
                                        (за исключением случаев, обозначенных в п. 4.9 СТО Газпром 1.9-2008 «Правила применения
                                        стандартов в ОАО «Газпром», его дочерних обществах и организациях»). В случае необходимости
                                        прямого применения указанных стандартов, как объектов авторского права, следует соблюсти п.
                                        4.10 СТО Газпром 1.9-2008 о заключении соответствующих соглашений или договоров, дающих право
                                        на их применение.
                                    </li>
                                    </div>
                                    <div className='number_li'>24.<li> Генпроектировщику подготовить и представить
                                        в адрес {main.customer_or_agent_type} паспорт объекта и данные о пространственном
                                        положении объекта, в соответствии с требованиями «Регламента по подготовке сведений
                                        по объектам добычи, транспортировки и подземного хранения газа ПАО «Газпром» для нужд
                                        Федеральной геоинформационной системы территориального планирования»,
                                        утвержденного ОАО «Газпром» 25.03.2015.
                                    </li>
                                    </div>
                                    <div className='number_li'>24.<li> Предусмотреть расчет затрат на подготовку материалов,
                                        необходимых для получения решений об установлении зон(ы) с особыми условиями использования
                                        территории, содержащие сведения о границах данной зон(ы), графическое описание
                                        местоположения границ данной зоны, перечень координат характерных точек этих границ
                                        в системе координат, установленной для ведения Единого государственного реестра недвижимости,
                                        обозначение (установление) зон с особыми условиями использования территории
                                        на местности специальными знаками.
                                    </li>
                                    </div>
                                    <div className='number_li'>24.<li> Предусмотреть расчет затрат на возмещение убытков правообладателям
                                        земельных участков, причиненных ограничением их прав, в связи с установлением/изменением зон с
                                        особыми условиями использования территорий (при необходимости).
                                    </li>
                                    </div>

                                </ol>
                            </div>
                        </div>
                    </div>
                    <div className="elem">
                        <h4>25. Требования к технологии, режиму предприятия и основному оборудованию</h4>
                        <div className="rigth-wrapper-item">
                            <div>
                                <ol>
                                    <div className='number_li'>25.<li> Режим работы предприятия – {main.business_hours}.</li></div>
                                    <div className='number_li'>25.<li>Применяемая в проектной документации трубная продукция (Технические условия)
                                        должна быть включена в Единый Реестр материально-технических ресурсов, допущенных к применению на объектах
                                        Общества и соответствующих требованиям ПАО «Газпром» (Единый Реестр МТР) (приказ ПАО «Газпром» от 03.10.2018
                                        № 582 «О применении Единого Реестра материально-технических ресурсов, допущенных к применению на объектах Общества
                                        и соответствующих требованиям ПАО «Газпром») и сертифицирована в Системе добровольной сертификации ИНТЕРГАЗСЕРТ
                                        (приказ ПАО «Газпром» от 24.11.2016 №751 и приказ ПАО «Газпром» от 28.06.2018 №361)</li>
                                    </div>
                                    {main.Provide_possibility_connecting_equipmenty === "Применять"
                                        ? <div className='number_li'>25.<li> Предусмотреть возможность подключения оборудования для продувки
                                            газовых коммуникаций азотом на
                                            период проведения ремонтных работ:</li>
                                        </div> : null}
                                    <div className='number_li'>25.<li>  Принятые технологии, оборудование,
                                        строительные решения, организация строительства и эксплуатации
                                        комплекса должны соответствовать нормам Российской Федерации и стандартам ПАО «Газпром».</li>
                                    </div>
                                    {main.provide_dewatering_technology === "Применять" ? <div className='number_li'>25.<li> На площадках и крановых узлах линейной части, расположенных
                                        в низинах и заболоченных местах, предусмотреть использование технологии водопонижения.</li>
                                    </div> : null}
                                    <div className='number_li'>25.<li> Рассмотреть возможность применения в проектной документации нанотехнологической, продукции,
                                        допущенной к применению на объектах ПАО «Газпром». В случае применения выполнить технико-экономическое сравнение
                                        указанной продукции с раннее апробированной на объектах ПАО «Газпром» с целью обоснования целесообразности
                                        её применения.</li>
                                    </div>
                                    <div className='number_li'>25.<li> . В комплект проектной документации включать справку с перечнем предусмотренной
                                        проектом нанотехнологической продукции (письмо ОАО «Газпром» от 12.08.2013 № 03/11-2334).</li>
                                    </div>
                                    <div className='number_li'>25.<li> Предусмотреть приоритетное применение в проектной документации
                                        инновационной продукции при прочих равных условиях с выполнением технико-экономического
                                        сравнения вариантов. В качестве единого централизованного источника информации принять «Реестр
                                        инновационной продукции для внедрения в ПАО «Газпром»</li>
                                    </div>
                                    <div className='number_li'>25.<li> При разработке документации предусмотреть применение отечественного
                                        импортозамещающего оборудования, оборудования с высокой степенью локализации производства на
                                        территории Российской Федерации или предусмотреть применение аналогичного оборудования производства
                                        государств, не поддержавших санкционную политику в отношении России (письмо ОАО «Газпром»
                                        от 18.12.2014 № 03/11-4214) прошедшего сертификацию в Системе добровольной сертификации
                                        ИНТЕРГАЗСЕРТ (приказ ПАО «Газпром» от 24.11.2016 № 751 и приказ ПАО «Газпром» от 28.06.2018
                                        № 361), имеющего сертификаты соответствия, акты и протоколы испытаний, подтверждающие
                                        технические характеристики, имеющего документы, подтверждающие соответствие требованиям
                                        Технических регламентов, действующих на момент разработки проекта, включенных в Единый
                                        Реестр МТР (приказ ПАО «Газпром» от 03.10.2018 № 582 «О применении Единого Реестра
                                        материально-технических ресурсов, допущенных к применению на объектах Общества
                                        и соответствующих требованиям ПАО «Газпром»).</li>
                                    </div>
                                    <div className='number_li'>25.<li> В случае отсутствия отечественных аналогов импортного оборудования
                                        и применения импортных МТР, а также импортных комплектующих в закупаемых МТР, представить
                                        обоснование применения импортных  МТР (поручение заместителя Председателя Правления
                                        ОАО «Газпром» В.А. Маркелова от 05.03.2015 № 03-1500 и приказа ПАО «Газпром» от 24.08.2015
                                        № 495 (с актуальными изменениями)). Обеспечить применение оборудования, материалов, прошедших
                                        подтверждение соответствие требованиям технических регламентов Евразийского экономического союза,
                                        а также сертифицированные на соответствие требованиям национальных стандартов и требованиям
                                        ПАО «Газпром» в Системе добровольной сертификации «ИНТЕРГАЗСЕРТ» (приказ ПАО «Газпром» от
                                        24.11.2016 № 751 и приказ ПАО «Газпром» от 28.06.2018 № 361).</li>
                                    </div>
                                    <div className='number_li'>25.<li> При проектировании учитывать требования к потребляемой/применяемой продукции (поручения протокола
                                        «Об организации управления материально-техническими ресурсами» от  26.10.2017 № 03-133):<br />
                                        Неприменения ссылок на документы, не являющихся документами Системы стандартизации ПAO «Газпром» и национальной системы
                                        стандартизации Российской Федерации, нормативных документов и стандартов дочерних обществ ПAO «Газпром»
                                        и других организаций, технических условиях производителей материально-технических ресурсов; применения при
                                        определении конкретных характеристик/показателей продукции преимущественно адресных ссылок (с указанием номеров
                                        конкретных положений) на документы Системы стандартизации ПAO «Газпром», в том числе вида Общих технических условий,
                                        и при целесообразности адресных ссылок на документы национальной системы стандартизации Российской Федерации.
                                    </li>
                                    </div>
                                    <div className='number_li'>25.<li> Определить необходимость создания стационарного объекта газозаправочной
                                        инфраструктуры КПГ (АГНКС) на проектируемом объекте. Выполнить технико-экономическое сравнение
                                        вариантов обеспечения автотранспорта ГМТ с целью обоснования целесообразности создания объекта ГЗИ.
                                    </li>
                                    </div>
                                    {main.filling_infrastructure_facility_being_designed === "Применять"
                                        ? <div className='number_li'>25.<li>  В комплект проектной документации включать справку
                                            с обоснованием необходимости/отсутствия необходимости создания стационарного объекта
                                            газозаправочной инфраструктуры КПГ (АГНКС) на проектируемом объекте.
                                        </li>
                                        </div> : null}
                                </ol>
                            </div>
                        </div>
                    </div>
                    <div className="elem">
                        <h4>26. Требования по энергосбережению</h4>
                        <div className="rigth-wrapper-item">
                            Разработать раздел «Мероприятия по обеспечению соблюдения требований энергетической эффективности
                            и требований оснащенности зданий, строений, сооружений приборами учета используемых энергетических
                            ресурсов» в соответствии с требованиями Федерального закона от 23.11.2009 № 261-ФЗ
                            «Об энергосбережении и о повышении энергетической эффективности и о внесении изменений в
                            отдельные законодательные акты Российской Федерации», Постановления Правительства Российской
                            Федерации от 15.05.2010 № 340 «О порядке установления требований к программам в области энергосбережения
                            и повышения энергетической эффективности организаций, осуществляющих регулируемые виды деятельности».
                        </div>
                    </div>
                    <div className="elem">
                        <h4>27. Требования к архитектурно-планировочным, конструктивным решениям</h4>
                        <div className="rigth-wrapper-item">
                            <ol>
                                <div className='number_li'>27.<li> По согласованию с {main.customer_or_agent_type}
                                    предусмотреть применение комплектно-блочного, а также узлового методов строительства.</li>
                                </div>
                                <div className='number_li'>27.<li> Цветовые решения принимать в соответствии с «Книгой
                                    фирменного стиля ПАО «Газпром» и «Типовой книгой фирменного стиля дочернего общества
                                    ПАО «Газпром», утвержденной постановлением Правления ПАО «Газпром» от 16.12.2019 № 48.</li>
                                </div>
                                <div className='number_li'>27.<li>  Для зданий и сооружений повышенного уровня ответственности
                                    предусмотреть научно-техническое сопровождение, включая работы по определению аэродинамических
                                    коэффициентов, и выполнение независимого контроля при проектировании в соответствии с
                                    требованиями ГОСТ 27751-2014 «Надежность строительных конструкций и оснований», а также
                                    указать сведения по определению.</li>
                                </div>
                                <div className='number_li'>27.<li>Расчёт санитарно-бытовых помещений и устройств выполнить в соответствии
                                    с СП 44.13330.2011 «Административные и бытовые здания. Актуализированная редакция СНиП 2.09.04-87».</li>
                                </div>
                                {main.composition_placement_premises_medical_units === "Применять"
                                    ? <div className='number_li'>27.<li> Состав и размещение помещений лечебных подразделений для медицинского
                                        обеспечения работников выполнить в соответствии с Приложением В СП 158.13330.2014 «Здания и помещения
                                        медицинских организаций. Правила проектирования» и согласовать на
                                        этапе ОТР с {main.customer_or_agent_type}.
                                    </li>
                                    </div> : null}
                                {main.request_Customer_Agent_agreed === "Применять"
                                    ? <div className='number_li'>27.<li> На этапе ОТР запросить у {main.customer_or_agent_type} согласованный с ПАО «Газпром» состав
                                        помещений для физкультурно-оздоровительного обеспечения работников в соответствии с СП 31-112-2004 Часть 1 и Часть 2
                                        «Физкультурно-спортивные залы».(пункт применяется к объектам, предполагающим в своем составе
                                        размещение помещений для физкультурно-оздоровительного обеспечения работников) этапе ОТР с {main.customer_or_agent_type}.
                                    </li>
                                    </div> : null}
                                {main.agree_Customer_Agent_PJSC_Gazprom_principle_operation === "Применять"
                                    ? <div className='number_li'>27.<li> На этапе ОТР согласовать с {main.customer_or_agent_type} и ПАО
                                        «Газпром» принцип работы и количество посадочных мест на предприятиях общественного питания в соответствии
                                        с п. 5.50 СП 44.13330.2011 «Административные и бытовые здания. Актуализированная редакция СНиП 2.09.04-87».
                                        (пункт применяется к объектам, предполагающим в своем составе размещение пунктов общественного питания работников).
                                    </li>
                                    </div> : null}
                                <div className='number_li'>27.<li>Перечень зданий, для которых необходимо обеспечить взрывоустойчивость, определить в
                                    процессе проектирования.</li>
                                </div>
                                {main.architecturally_significant_buildings === "Применять"
                                    ? <div className='number_li'>27.<li> Для архитектурно-значимых зданий, строений и сооружений объекта
                                        проектирования (здания ВЖК, административно-бытового и социально-культурного назначения, а также иные
                                        объекты капитального строительства непроизводственного назначения) предусмотреть разработку
                                        дизайн-проектов/концепций интерьеров помещений по отдельному техническому заданию на разработку
                                        интерьерных решений. Перечень помещений определяет {main.customer_or_agent_type}.
                                        (пункт не применяется для проектов, по которым разработка интерьерных решений не предусмотрена)
                                    </li>
                                    </div> : null}
                            </ol>
                        </div>
                    </div>
                    <div className="elem">
                        <h4>28. Использование зданий комплектной поставки</h4>
                        <div className="rigth-wrapper-item">
                            {main.buildings_complete_delivery === "Требуется" ? <div>
                                Использование зданий комплектной поставки На блочно-комплектное оборудование высокой и
                                (или) полной заводской готовности указать заводу-изготовителю (поставщику) требование о
                                необходимости предоставления комплектовочной ведомости (спецификации) с указанием наименований
                                и обозначений комплектующих изделий и их производителей.
                            </div> : <div>Использование зданий комплектной поставки {main.buildings_complete_delivery}</div>}
                        </div>
                    </div>
                    <div className="elem">
                        <h4>30. Технологическая связь</h4>
                        <div className="rigth-wrapper-item">
                            <ol>
                                <div className='number_li'>30.<li> Проектные решения разработать в соответствии с действующими
                                    законодательными актами и нормативными документами Российской Федерации, стандартами
                                    ПАО «Газпром», с учётом технических требований на проектирование (Приложение № 1) и
                                    полученных от {main.customer_or_agent_type} технических условий.</li>
                                </div>
                                <div className='number_li'>30.<li> Провести анализ существующих технических средств, линий и
                                    сооружений связи в районе строительства объекта. </li>
                                </div>
                                <div className='number_li'>30.<li> При разработке проектных решений предусмотреть максимальное
                                    использование имеющихся ресурсов технологической сети связи.</li>
                                </div>
                                <div className='number_li'>30.<li> Основные технические решения в области связи, технические условия,
                                    перечень и технические характеристики оборудования согласовать
                                    с {main.customer_or_agent_type} и профильным структурным подразделением ПАО «Газпром».</li>
                                </div>
                            </ol>
                        </div>
                    </div>
                    <div className="elem">
                        <h4>31. Энергоснабжение</h4>
                        <div className="rigth-wrapper-item">
                            <ol>
                                <div className='number_li'>31.<li> Выполнить анализ существующих систем энергоснабжения. Рассмотреть
                                    возможность использования существующих систем энергоснабжения в районе строительства на основании
                                    полученных от владельца инженерных сетей (сетевой организации, дочернего общества ПАО «Газпром»)
                                    технических условий на технологическое присоединение. Технические условия
                                    предоставляет {main.customer_or_agent_type}.</li>
                                </div>
                                <div className='number_li'>31.<li> При необходимости, предусмотреть реконструкцию систем энергоснабжения, эксплуатируемых
                                    дочерним обществом ПАО «Газпром», в объеме, определенном в технических условиях на энергоснабжение. </li>
                                </div>
                                <div className='number_li'>31.<li> ПСхемные и технические решения по энергообеспечению объектов
                                    (электроснабжение, теплоснабжение, водоснабжение и водоотведение) и состав основного
                                    энергетического оборудования согласовать с эксплуатирующей организацией и ПАО «Газпром» в
                                    установленном порядке. Согласование обеспечивает {main.customer_or_agent_type}. Результаты согласования
                                    (материалы и письма) приложить к проектной документации.</li>
                                </div>
                                <div className='number_li'>31.<li>  В проекте предусмотреть применение энергетического оборудования, прошедшего
                                    процедуру сертификации и испытания в установленном в ПАО «Газпром» порядке и
                                    соответствующего требованиям ПАО «Газпром».</li>
                                </div>
                                <div className='number_li'>31.<li> При разработке ОТР/проектной документации обосновать выбор:
                                    схемы внешнего электроснабжения, источников электрогенерации с учетом технических условий, выданных электроснабжающей организацией;
                                    выбор количества и единичной мощности электроагрегатов (для ЭСН);
                                    схем теплоснабжения и типа основного и резервного источника тепла;
                                    источников водоснабжения;
                                    методов утилизации сточных вод.
                                </li>
                                </div>
                                <div className='number_li'>31.<li>  При необходимости в составе ОТР выполнить ТЭС вариантов
                                    энергообеспечения объекта.
                                </li>
                                </div>
                                <div className='number_li'>31.<li>Конструктивное исполнение зданий
                                    (в т.ч., блочно-контейнерного и блочно-модульного исполнения)
                                    для размещения энергетического оборудования должно быть обосновано.</li>
                                </div>
                                <div className='number_li'>31.<li>В проектной документации предусмотреть разработку
                                    отдельного тома «Электромагнитная совместимость» в соответствии с требованиями
                                    СТО Газпром 2-1.11-290-2009 «Положение по обеспечению электромагнитной совместимости
                                    производственных объектов ОАО «Газпром».</li>
                                </div>
                                <div className='number_li'>31.<li> При проектировании ЛЭП учесть в объемах
                                    строительно-монтажных работ расчистку просеки с учетом охранной зоны в соответствии
                                    с требованием постановления Правительства Российской Федерации от 24.02.2009 № 160.</li>
                                </div>
                            </ol>
                        </div>
                    </div>
                    <div className="elem">
                        <h4>32. Требования к защите от коррозии</h4>
                        <div className="rigth-wrapper-item">
                            <ol>
                                <div className='number_li'>32.<li>В составе проектной документации предусмотреть разработку раздела
                                    «Защита от коррозии», в текстовой части которого предусмотреть следующие разделы:<br />
                                    изоляционные, защитные покрытия и материалы;<br />
                                    ингибиторная защита (при технико-экономическом обосновании);<br />
                                    электрохимическая защита;<br />
                                    система коррозионного мониторинга, дистанционный контроль и управление оборудованием электрохимической защиты (ЭХЗ);<br />
                                    электроснабжение средств ЭХЗ.<br />
                                </li>
                                </div>
                                <div className='number_li'>32.<li> Основные технические характеристики принять в соответствии с подразделом
                                    «Требования к защите от коррозии» технических требований на проектирование (Приложение № 1).</li>
                                </div>
                                <div className='number_li'>32.<li> При разработке проектной документации применить оборудование и материалы
                                    противокоррозионной защиты (ПКЗ), разрешенные к применению на объектах ПАО «Газпром».</li>
                                </div>
                                <div className='number_li'>32.<li> Предусмотреть применение защитных покрытий от атмосферной коррозии, систем покрытий и лакокрасочных материалов для противокоррозионной защиты металлоконструкций,
                                    технологических сооружений и оборудования, разрешенных к применению на объектах ПАО «Газпром».</li>
                                </div>
                                <div className='number_li'>32.<li> Цветовые решения для защиты от атмосферной коррозии технологических и
                                    производственных объектов должны соответствовать цветам корпоративного стиля ПАО «Газпром».</li>
                                </div>
                                <div className='number_li'>32.<li> Перечень оборудования и материалов, номенклатуру и характеристики системы
                                    электрохимической защиты, системы коррозионного мониторинга, системы контроля эффективности ингибиторной
                                    защиты, системы защитных покрытий подземного и надземного технологического оборудования, ингибиторы коррозии,
                                    вставки электроизолирующие, диэлектрические ложементы и др. применяемые при разработке проектной документации,
                                    согласовать с ПАО «Газпром» в установленном порядке.</li>
                                </div>
                            </ol>
                        </div>
                    </div>
                    <div className="elem">
                        <h4>33. Автоматизация</h4>
                        <div className="rigth-wrapper-item">
                            <ol>
                                <div className='number_li'>33.<li>Проектную документацию в части автоматизации выполнить
                                    в соответствии с ГОСТ 34 серии (ГОСТ 34.601, ГОСТ 34.201, ГОСТ 34.602 и т.д.) и СТО
                                    Газпром 2-1.12-434-2010 c соблюдением стадийности разработки систем автоматизации
                                    (детализация требований и разработка концептуальных решений в ОТР, согласование типов
                                    применяемых средств и систем автоматизации на их основе, разработка и согласование
                                    технических заданий (ТЗ) на создание/расширение систем автоматизации в соответствии с ГОСТ
                                    34.602, разработка проектной документации на их основе, последующая разработка рабочей
                                    документации), а также полноты и комплектности документации.</li>
                                </div>
                                <div className='number_li'>33.<li>Провести анализ действующих и создаваемых в рамках других
                                    проектов в районе строительства средств и систем автоматизации с целью оптимального
                                    использования ресурса программно-технических средств и каналов передачи данных.</li>
                                </div>
                                {main.type_of_construction === "Новое строительство" ? <div className='number_li'>33.<li>Предусмотреть создание единого комплекса систем автоматизации,
                                    реализующего функции комплексного управления и защиты всей цепочки проектируемых объектов.</li>
                                </div> : null}
                                {main.type_of_construction === "Реконструкция" || main.type_of_construction === "Техническое перевооружение"
                                    ? <div className='number_li'>33.<li>По результатам анализа, выполненного в соответствии с п. 33.2, предусмотреть расширение
                                        и/или реконструкцию (модернизацию, техническое перевооружение) существующих средств и систем автоматизации. </li>
                                    </div> : null}
                                <div className='number_li'>33.<li> Реализовать интеграцию создаваемых (расширяемых, реконструируемых) систем
                                    автоматизации в смежные и вышестоящие системы автоматизации, включая систему оперативно-диспетчерского
                                    управления (СОДУ) и информационно-управляющую систему производственными процессами (ИУС ПП) из состава
                                    ИУС П для унификации нормативно-справочной информации и обеспечения информационного взаимодействия
                                    автоматизируемых бизнес-процессов. При необходимости предусмотреть расширение соответствующих систем.</li>
                                </div>
                                <div className='number_li'>33.<li> В проектных решениях по автоматизации учесть этапность ввода
                                    объектов строительства (реконструкции).</li>
                                </div>
                                <div className='number_li'>33.<li>Все проектно-создаваемые и комплектно-поставляемые в рамках
                                    проекта средства и системы автоматизации, в т.ч. программно-технические средства (ПТС),
                                    контрольно-измерительные приборы (КИП), блоки управления исполнительными механизмами (БУ ИМ)
                                    - должны быть российского производства.</li>
                                </div>
                                <div className='number_li'>33.<li> Согласовать с {main.customer_or_agent_type}, эксплуатирующей организацией и ПАО «Газпром» в установленном порядке:
                                    типы применяемых ПТС, КИП, СПА, средств контроля загазованности, БУ ИМ по комплектно-поставляемым и
                                    проектно-создаваемым системам автоматизации, в том числе системам и средств пожарной автоматики;
                                    структурные схемы комплекса технических средств (КТС);
                                </li>
                                </div>
                                <div className='number_li'>33.<li> Согласовать с {main.customer_or_agent_type}, эксплуатирующей организацией и ПАО «Газпром» в установленном порядке:
                                    типы применяемых ПТС, КИП, СПА, средств контроля загазованности, БУ ИМ по комплектно-поставляемым и
                                    проектно-создаваемым системам автоматизации, в том числе системам и средств пожарной автоматики;
                                    структурные схемы комплекса технических средств (КТС);<br />
                                    ТЗ на проектно-создаваемые системы автоматизации;<br />
                                    технические части документации о закупке (ТЧДЗ) технологического оборудования в части требований к средствам и системам автоматизации;<br />
                                    технические требования (ТТ), ТЗ, опросные листы (ОЛ) на изготовление технологического оборудования, поставляемого комплектно со средствами и системами автоматизации (ПТС, КИП, СПА, средствами контроля загазованности, БУ ИМ), в том числе системам пожарной автоматики;<br />
                                    спецификации оборудования и программного обеспечения на средства и системы автоматизации.
                                </li>
                                </div>
                                <div className='number_li'>33.<li> Для согласования типов ПТС необходимо представить в ПАО «Газпром» в
                                    установленном порядке согласованные с {main.customer_or_agent_type} и эксплуатирующей
                                    организацией обоснования, включая организационные решения по оперативному и
                                    диспетчерскому управлению объектом, перечень существующих систем автоматизации с
                                    указанием типов ПТС и сроков ввода в эксплуатацию, перечень функциональных задач
                                    существующих (при наличии) и создаваемых (расширяемых, реконструируемых, модернизируемых)
                                    систем автоматизации, учитывающие состав объектов автоматизации и распределение
                                    систем на комплектно-поставляемые и проектно-создаваемые - в объеме, достаточном для выбора ПТС.
                                </li>
                                </div>
                                {main.item_applies === "Применяется" ?
                                    <div className='number_li'>33.<li> Все разрабатываемые в составе проектной документации
                                        технические задания (частные технические задания), технические требования, технические
                                        условия, ТЧДЗ, ОЛ на создание (закупку, поставку, изготовление) информационных систем,
                                        автоматизированных систем управления, систем автоматического управления, а также
                                        технологическое оборудование, содержащее в своем составе данные системы, должны
                                        содержать раздел «Требования к обеспечению информационной безопасности». Указанные
                                        документы в части требований к обеспечению информационной безопасности необходимо
                                        согласовать со Службой корпоративной защиты ПАО «Газпром».
                                        (пункт применяется, если в документе приводятся сведения о разработке
                                        технических заданий, технических требований на создание информационных систем,
                                        автоматизированных систем управления, систем автоматического управления)
                                    </li>
                                    </div> : null}
                                {main.item_applies_objects === "Применяется" ?
                                    <div className='number_li'>33.<li> Разработчикам автоматизированных систем управления
                                        технологическими процессами обеспечить: взаимодействие (интеграцию) программного
                                        обеспечения и (или) программно-аппаратных средств систем автоматизации со средствами
                                        (системами) защиты информации с целью реализации мер по аудиту безопасности, обеспечению
                                        целостности и доступности; приоритетное применение в составе подсистемы безопасности
                                        объекта критической информационной инфраструктуры средств защиты информации,
                                        встроенных в программное обеспечение и (или) программно-аппаратные средства
                                        автоматизированных систем управления технологическими процессами и сертифицированных
                                        на соответствие требованиям по безопасности или прошедших оценку соответствия в форме
                                        испытаний или приемки.
                                    </li>
                                    </div> : null}
                            </ol>
                        </div>
                    </div>
                    <div className="elem">
                        <h4>34. Метрологическое обеспечение и организация измерений углеводородных сред</h4>
                        <div className="rigth-wrapper-item">
                            {main.metrological_support_organization_measurements_hydrocarbon_media === "Требуется" ? <ol>
                                <div className='number_li'>34.<li> В проектной документации разработать раздел «Метрологическое
                                    обеспечение {main.metrological_support_1} ». В разделе представить материалы,
                                    относящиеся к области метрологического обеспечения {main.metrological_support_2} на проектируемом объекте
                                </li>
                                </div>
                                <div className='number_li'>34.<li>.При разработке раздела руководствоваться требованиями СТО Газпром 5.85-2020
                                    «Метрологическое обеспечение при проектировании объектов газовой промышленности».
                                </li>
                                </div>
                            </ol> : <ol>
                                <div className='number_li'>34.<li>{main.metrological_support_organization_measurements_hydrocarbon_media}</li>
                                </div>
                            </ol>}
                        </div>
                    </div>
                    <div className="elem">
                        <h4>35. Требования по режиму безопасности и гигиене труда</h4>
                        <div className="rigth-wrapper-item">
                            <ol>
                                <div className='number_li'>35.<li>   В составе проектной документации в соответствии с Постановлением № 87 разработать следующие части:
                                    Сведения о численности и профессионально-квалификационном составе персонала с распределением по группам производственных процессов, количестве и оснащенности рабочих мест;
                                    Условия труда работников и мероприятия, обеспечивающие требования охраны труда при эксплуатации {main.working_conditions_employees_activities}.
                                </li>
                                </div>
                                <div className='number_li'>35.<li>При разработке раздела руководствоваться требованиями Трудового кодекса
                                    Российской Федерации от 30.12.2001 № 197-ФЗ, «Порядком разработки и проведения экспертизы
                                    предпроектной и проектной документации по реконструкции, техническому перевооружению и новому
                                    строительству объектов ПАО «Газпром» в части обеспечения персоналом», утвержденным приказом ПАО
                                    «Газпром» от 07.12.2017 № 821 с изменениями, внесенными приказом ПАО «Газпром» от 06.03.2020 № 111,
                                    а также другими действующими законодательными актами и нормативными документами Российской Федерации,
                                    ПАО «Газпром», содержащими требования к нормированию труда работников.</li>
                                </div>
                                <div className='number_li'>35.<li> Расчет нормативной численности работников проектируемого объекта выполнить
                                    в соответствии с действующими нормативными документами ПАО «Газпром» в части нормирования труда
                                    работников. Форму расчета выполнить в соответствии с Приложениями 1 и 2 «Порядка разработки и проведения
                                    экспертизы предпроектной и проектной документации по реконструкции, техническому перевооружению и
                                    новому строительству объектов ПАО «Газпром» в части обеспечения персоналом», утвержденного приказом ПАО
                                    «Газпром» от 07.12.2017 № 821 с изменениями, внесенными приказом ПАО «Газпром» от 06.03.2020 № 111).</li>
                                </div>
                                <div className='number_li'>35.<li>Раздел разработать в соответствии с Федеральным законом от 30.03.1999 №
                                    52-ФЗ «О санитарно-эпидемиологическом благополучии населения», требованиями СП 2.2.3670-20
                                    «Санитарно-эпидемиологические требования к условиям труда» и другими действующими законодательными
                                    актами и нормативными документами Российской Федерации, стандартами ПАО «Газпром», содержащими
                                    требования охраны труда на объектах газовой промышленности.
                                </li>
                                </div>
                                <div className='number_li'>35.<li>Решения по нанесению знаков безопасности и других средств визуальной
                                    информации для обозначения опасных зон выполнить в соответствии с СТО Газпром 18000.2-007-2018
                                    «ЕСУОТ и ПБ. Порядок применения знаков безопасности и других средств визуальной информации на объектах
                                    ПАО «Газпром» и представить в соответствующем разделе проекта.
                                </li>
                                </div>
                            </ol>
                        </div>
                    </div>
                    <div className="elem">
                        <h4>36. Требования по ассимиляции производства</h4>
                        <div className="rigth-wrapper-item"><ol>
                            <div className='number_li'>36.<li>  Требования по ассимиляции производства
                            </li>
                            </div>
                            <div className='number_li'>36.<li> Максимально использовать существующие здания,
                                инженерные сети и коммуникации действующего объекта.</li></div>
                            <div className='number_li'>36.<li>  Необходимость строительства новых зданий, сооружений,
                                конструкций, сетей и инженерных коммуникаций обосновать в проекте технико-экономическими
                                расчетами с учетом требований нормативных документов.
                            </li>
                            </div>
                        </ol>
                        </div>
                    </div>
                    <div className="elem">
                        <h4>37. Требования к разработке перечня мероприятий по гражданской обороне, мероприятий по предупреждению чрезвычайных ситуаций природного и техногенного характера</h4>
                        <div className="rigth-wrapper-item">
                            {main.requirements_development_list_civil_defense_measures === "Требуется" ? <ol>
                                <div className='number_li'>37.<li>  Проектную документацию выполнить в соответствии с требованиями
                                    Федерального закона от 12.02.1998 № 28-ФЗ «О гражданской обороне», Федерального закона от 21.12.1994
                                    № 68-ФЗ «О защите населения и территорий от чрезвычайных ситуаций природного и техногенного характера»
                                    и других нормативных документов в области гражданской обороны, предупреждения и ликвидации
                                    чрезвычайных ситуаций природного и техногенного характера (национальные стандарты, своды
                                    правил, приказы, распоряжения и стандарты ПАО «Газпром»).

                                </li>
                                </div>
                                <div className='number_li'>37.<li>Раздел разработать в соответствии с требованиями ГОСТ Р
                                    55201-2012 «Безопасность в чрезвычайных ситуациях. Порядок разработки перечня мероприятий
                                    по гражданской обороне, мероприятий по предупреждению чрезвычайных ситуаций природного и
                                    техногенного характера при проектировании объектов капитального строительства».</li>
                                </div>
                                <div className='number_li'>37.<li> В установленном порядке осуществить сбор исходных данных для разработки мероприятий
                                    по гражданской обороне, мероприятий по предупреждению чрезвычайных ситуаций природного и техногенного характера.
                                </li>
                                </div>
                            </ol> : <ol>
                                <div className='number_li'>37.<li>{main.requirements_development_list_civil_defense_measures}</li>
                                </div>
                            </ol>}
                        </div>
                    </div>
                    <div className="elem">
                        <h4>38. Требования по пожарной безопасности</h4>
                        <div className="rigth-wrapper-item"><ol>
                            <div className='number_li'>38.<li>  Проектные решения по обеспечению пожарной безопасности принять
                                в соответствии с требованиями Федерального закона от 22.07.2008 № 123- ФЗ «Технический регламент
                                о требованиях пожарной безопасности», Федерального закона от 21.12.1994 № 69-ФЗ «О пожарной
                                безопасности», Федерального закона от 30.12.2009 № 384-ФЗ «Технический регламент о безопасности
                                зданий и сооружений», а также других действующих нормативных документов, содержащих требования
                                пожарной безопасности федерального, местного и отраслевого уровня, и нормативных документов
                                разработанных в их развитие.</li>
                            </div>
                        </ol>
                        </div>
                    </div>
                    <div className="elem">
                        <h4>39. Требования к системам безопасности и защите объектов</h4>
                        <div className="rigth-wrapper-item"><ol>
                            {main.type_of_construction === "Реконструкция" && main.type_of_construction === "Техническое перевооружение"
                                ? <div className='number_li'>39.<li>Проектные решения по обеспечению пожарной безопасности принять
                                    в соответствии с требованиями Федерального закона от 22.07.2008 № 123- ФЗ «Технический регламент
                                    о требованиях пожарной безопасности», Федерального закона от 21.12.1994 № 69-ФЗ «О пожарной
                                    безопасности», Федерального закона от 30.12.2009 № 384-ФЗ «Технический регламент о безопасности
                                    зданий и сооружений», а также других действующих нормативных документов, содержащих требования
                                    пожарной безопасности федерального, местного и отраслевого уровня, и нормативных документов
                                    разработанных в их развитие.</li>
                                </div> : null}
                            {main.type_of_construction === "Реконструкция" && main.type_of_construction === "Техническое перевооружение"
                                ? <div className='number_li'>39.<li>Проектные решения по обеспечению пожарной безопасности принять
                                    в соответствии с требованиями Федерального закона от 22.07.2008 № 123- ФЗ «Технический регламент
                                    о требованиях пожарной безопасности», Федерального закона от 21.12.1994 № 69-ФЗ «О пожарной
                                    безопасности», Федерального закона от 30.12.2009 № 384-ФЗ «Технический регламент о безопасности
                                    зданий и сооружений», а также других действующих нормативных документов, содержащих требования
                                    пожарной безопасности федерального, местного и отраслевого уровня, и нормативных документов
                                    разработанных в их развитие.</li>
                                </div> : null}
                        </ol>
                        </div>
                    </div>
                    <Button
                        className="export-button"
                        label="Export as .docx"
                        onClick={() =>
                            Export2Word('exportContent', 'word-content.docx')
                        }
                    />
                </div>
            </>

        );
    }
    return <div></div>;
};

export default RideSideComp;
