import React from 'react';
export const stracture = {
    type: 'Start',
    variable: 'main',
    children: [
        {
            type: 'TitleItem',
            title: '1. Основание для проектирования',
            icon: '',
            variable: '',
        },
        {
            type: 'UpploadFile',
            title: '',
            icon: '',
            variable: '',
        },
        {
            type: 'TitleItem',
            title: '1.1 Перечень приоритетных проектов на 10-летний период',
            icon: '',
            variable: '',
        },
        {
            type: 'UpploadFile',
            title: '',
            icon: '',
            variable: '',
        },
        {
            type: 'TitleItem',
            title: '1.2 Перечень приоритетных проектов на 10-летний период',
            icon: '',
            variable: '',
        },
        {
            type: 'UpploadFile',
            title: '',
            icon: '',
            variable: '',
        },
        {
            type: 'TitleItem',
            title: '1.3 Перечень приоритетных проектов на 10-летний период',
            icon: '',
            variable: '',
        },
        {
            type: 'UpploadFile',
            title: '',
            icon: '',
            variable: '',
        },
        {
            type: 'TitleItem',
            title: '1.4 Перечень приоритетных проектов на 10-летний период',
            icon: '',
            variable: '',
        },
        {
            type: 'UpploadFile',
            title: '',
            icon: '',
            variable: '',
        },
        {
            type: 'TitleItem',
            title: '1.5 Перечень приоритетных проектов на 10-летний период',
            icon: '',
            variable: '',
        },
        {
            type: 'UpploadFile',
            title: '',
            icon: '',
            variable: '',
        },
        {
            type: 'TitleItem',
            title: '2. Месторасположение предприятия, здания, сооружения',
            icon: '',
            variable: '',
        },
        {
            type: 'selectItem',
            title: 'Наименование области (округа)',
            icon: '',
            variable: 'region_district',
            options: [
                {
                    label: 'ЦентрНаименование области (округа)альный федеральный округ',
                    id: 'ЦентрНаименование области (округа)альный федеральный округ',
                },
                {
                    label: 'Северо-Западный федеральный округ',
                    id: 'Северо-Западный федеральный округ',
                },
                {
                    label: 'Южный федеральный округ',
                    id: 'Южный федеральный округ',
                },
                {
                    label: 'Северо-Кавказский Федеральный округ',
                    id: 'Северо-Кавказский Федеральный округ',
                },
                {
                    label: 'Приволжский федеральный округ',
                    id: 'Приволжский федеральный округ',
                },
                {
                    label: 'Уральский федеральный округ',
                    id: 'Уральский федеральный округ',
                },
                {
                    label: 'Сибирский федеральный округ',
                    id: 'Сибирский федеральный округ',
                },
                {
                    label: 'Дальневосточный федеральный округ',
                    id: 'Дальневосточный федеральный округ',
                },
            ],
        },
        {
            type: 'selectItem',
            title: 'Центральный федеральный округ',
            icon: '',
            variable: 'capacity',
            options: [
                {
                    label: 'Центральный федеральный округ',
                    id: 'Центральный федеральный округ',
                },
                {
                    label: 'Северо-Западный федеральный округ',
                    id: 'Северо-Западный федеральный округ',
                },
                {
                    label: 'Южный федеральный округ',
                    id: 'Южный федеральный округ',
                },
                {
                    label: 'Северо-Кавказский федеральный округ',
                    id: 'Северо-Кавказский федеральный округ',
                },
                {
                    label: 'Приволжский федеральный округ',
                    id: 'Приволжский федеральный округ',
                },
                {
                    label: 'Уральский федеральный округ',
                    id: 'Уральский федеральный округ',
                },
                {
                    label: 'Сибирский федеральный округ',
                    id: 'Сибирский федеральный округ',
                },
                {
                    label: 'Дальневосточный федеральный округ',
                    id: 'Дальневосточный федеральный округ',
                },
            ],
        },
        {
            type: 'selectItem',
            title: 'Наименование района строительства',
            icon: '',
            variable: 'development_regions',
            options: [
                {
                    label: 'Алагирский',
                    id: 'Алагирский',
                },
                {
                    label: 'Ардонский',
                    id: 'Ардонский',
                },
                {
                    label: 'Дигорский',
                    id: 'Дигорский',
                },
                {
                    label: 'Ирафский',
                    id: 'Ирафский',
                },
                {
                    label: 'Кировский',
                    id: 'Кировский',
                },
                {
                    label: 'Моздокский',
                    id: 'Моздокский',
                },
                {
                    label: 'Правобережный',
                    id: 'Правобережный',
                },
                {
                    label: 'Пригородный',
                    id: 'Пригородный',
                },
            ],
        },
        {
            type: 'selectItem',
            title: 'Вид строительства',
            icon: '',
            variable: 'type_of_construction',
            options: [
                {
                    label: 'Новое строительство',
                    id: 'Новое строительство',
                },
                {
                    label: 'Техническое перевооружение',
                    id: 'Техническое перевооружение',
                },
                {
                    label: 'Реконструкция',
                    id: 'Реконструкция',
                },
                {
                    label: 'Прочее',
                    id: 'Прочее',
                },
            ],
        },
        {
            type: 'TitleItem',
            title: '3. Заказчик/Агент',
            icon: '',
            variable: '',
        },
        {
            type: 'selectItem',
            title: 'Выбрать тип',
            icon: '',
            variable: 'customer_or_agent_type',
            options: [
                {
                    label: 'Заказчик',
                    id: 'Заказчик',
                },
                {
                    label: 'Агент',
                    id: 'Агент',
                },
            ],
        },
        {
            type: 'selectItem',
            title: 'Наименование организации',
            icon: '',
            variable: 'customer_agent_organization',
            options: [
                {
                    label: 'ООО “Компания 1',
                    id: 'ООО “Компания 1”',
                },
                {
                    label: 'ООО “Компания 2”',
                    id: 'ООО “Компания 2”',
                },
                {
                    label: 'ООО “Компания 3”',
                    id: 'ООО “Компания 3”',
                },
            ],
        },
        {
            type: 'TitleItem',
            title: '4. Инвестор',
            icon: '',
            variable: '',
        },
        {
            type: 'selectItem',
            title: 'Наименование организации',
            icon: '',
            variable: 'investor_organization',
            options: [
                {
                    label: 'ООО “Компания 4”',
                    id: 'ООО “Компания 4”',
                },
                {
                    label: 'ООО “Компания 5”',
                    id: 'ООО “Компания 5”',
                },
                {
                    label: 'ООО “Компания 6”',
                    id: 'ООО “Компания 6”',
                },
            ],
        },
        {
            type: 'TitleItem',
            title: '5. Эксплуатирующая организация',
            icon: '',
            variable: '',
        },
        {
            type: 'selectItem',
            title: 'Наименование организации',
            icon: '',
            variable: 'company_organization',
            options: [
                {
                    label: 'ООО “Компания 7”',
                    id: 'ООО “Компания 7”',
                },
                {
                    label: 'ООО “Компания 8”',
                    id: 'ООО “Компания 8”',
                },
                {
                    label: 'ООО “Компания 9”',
                    id: 'ООО “Компания 9”',
                },
            ],
        },
        {
            type: 'TitleItem',
            title: '6. Генеральная проектная организация',
            icon: '',
            variable: '',
        },
        {
            type: 'selectItem',
            title: 'Выбрать тип',
            icon: '',
            variable: 'organization_type',
            options: [
                {
                    label: 'Определяется на конкурентной основе',
                    id: 'Определяется на конкурентной основе',
                },
                {
                    label: 'Организация выбрана',
                    id: 'Организация выбрана',
                },
            ],
        },
        {
            type: 'TitleItem',
            title: '7.1 Способ определения субподрядных организаций',
            icon: '',
            variable: '',
        },
        {
            type: 'selectItem',
            title: 'Субподрядные организации разрабатывают',
            icon: '',
            variable: 'project_organization',
            options: [
                // {
                //     label: 'разделы проектной документации',
                //     id: 'разделы проектной документации',
                // },
                // {
                //     label: 'разделы проектной и основных комплектов рабочей документации',
                //     id: 'разделы проектной и основных комплектов рабочей документации',
                // },
            ],
        },
        {
            type: 'TitleItem',
            title: '7.2 Субподрядные организации для разработки разделов',
            icon: '',
            variable: '',
        },

        {
            type: 'TitleItem',
            title: '8. Вид работ',
            icon: '',
            variable: '',
        },
        {
            type: 'selectItem',
            title: 'Вид работ',
            icon: '',
            variable: 'Type_of_work',
            options: [
                {
                    label: 'Новое строительство',
                    id: 'Новое строительство',
                },
                {
                    label: 'Реконструкция',
                    id: 'Реконструкция',
                },
                {
                    label: 'Техническое перевооружение',
                    id: 'Техническое перевооружение',
                },
            ],
        },
        {
            type: 'TitleItem',
            title: '9. Источник финансирования',
            icon: '',
            variable: '',
        },
        {
            type: 'InputText',
            title: 'Источник финансирования',
            incon: '',
            variable: 'Source_of_financing',
        },
        {
            type: 'TitleItem',
            title: '10. Срок выполнения работы',
            icon: '',
            variable: 'Work_completion_time',
        },
        {
            type: 'InputText',
            title: 'Срок выполнения работы',
            incon: '',
            variable: 'Work_completion_time',
        },
        {
            type: 'TitleItem',
            title: '11. Исходные данные',
            icon: '',
            variable: '',
        },
        {
            type: 'UpploadFile',
            title: '11.1 Наименование, шифр (договор), вид предпроектной документации',
            icon: '',
            variable: '',
        },
        {
            type: 'InputText',
            title: '11.1 Наименование, шифр (договор), вид предпроектной документации',
            incon: '',
            variable: 'Initial_data',
        },
        {
            type: 'TitleItem',
            title: '11.2 Заключение о результатах экспертизы ПАО «Газпром» предпроектной документации',
            icon: '',
            variable: '',
        },
        {
            type: 'InputText',
            title: 'Заключение о результатах экспертизы ПАО «Газпром» предпроектной документации',
            incon: '',
            variable: 'Conclusion_results',
        },
        {
            type: 'UpploadFile',
            title: '11.2 Заключение о результатах экспертизы ПАО «Газпром» предпроектной документации',
            icon: '',
            variable: 'Conclusion_results',
        },
        {
            type: 'TitleItem',
            title: '11.3 Действующие проектные документы на разработку месторождений, согласованные Комиссией газовой промышленности по разработке месторождений и использованию недр ПАО «Газпром»',
            icon: '',
            variable: '',
        },
        {
            type: 'UpploadFile',
            title: '11.3 Действующие проектные документы на разработку месторождений, согласованные Комиссией газовой промышленности по разработке месторождений и использованию недр ПАО «Газпром»',
            icon: '',
            variable: 'Current_project_documents_11_3',
        },
        {
            type: 'InputText',
            title: '11.3 Действующие проектные документы на разработку месторождений, согласованные Комиссией газовой промышленности по разработке месторождений и использованию недр ПАО «Газпром»',
            incon: '',
            variable: 'Current_project_documents_11_3',
        },
        {
            type: 'TitleItem',
            title: '11.4 Действующие проектные документы на разработку месторождений, согласованные ЦКР Роснедр по УВС',
            icon: '',
            variable: '',
        },
        {
            type: 'UpploadFile',
            title: '11.4 Действующие проектные документы на разработку месторождений, согласованные ЦКР Роснедр по УВС',
            icon: '',
            variable: 'Current_project_documents_11_4',
        },
        {
            type: 'InputText',
            title: '11.4 Действующие проектные документы на разработку месторождений, согласованные ЦКР Роснедр по УВС',
            incon: '',
            variable: 'Current_project_documents_11_4',
        },
        {
            type: 'TitleItem',
            title: '11.5 Проектная документация <Наименование, шифр (договор)>, утвержденная в соответствующем порядке',
            icon: '',
            variable: '',
        },
        {
            type: 'UpploadFile',
            title: '11.5 Проектная документация <Наименование, шифр (договор)>, утвержденная в соответствующем порядке',
            icon: '',
            variable: 'Project_documentation',
        },
        {
            type: 'InputText',
            title: 'Проектная документация <Наименование, шифр (договор)>, утвержденная в соответствующем порядке',
            incon: '',
            variable: 'Project_documentation',
        },
        {
            type: 'TitleItem',
            title: '12. Вид документации',
            icon: '',
            variable: '',
        },
        {
            type: 'selectItem',
            title: '12. Вид документации',
            icon: '',
            variable: 'type_documentation',
            options: [
                {
                    label: 'Проектная',
                    id: 'Проектная',
                },
                {
                    label: 'Проектная и рабочая',
                    id: 'Проектная и рабочая',
                },
            ],
        },
        {
            type: 'selectItem',
            title: 'Необходимость разработки ОТР',
            icon: '',
            variable: 'develop_OTR',
            options: [
                {
                    label: 'Да',
                    id: 'Да',
                },
                {
                    label: 'Нет',
                    id: 'Нет',
                },
            ],
        },
        {
            type: 'TitleItem',
            title: '13. Требования к выделению этапов строительства',
            icon: '',
            variable: '',
        },
        {
            type: 'selectItem',
            title: '13. Требования к выделению этапов строительства',
            icon: '',
            variable: 'requirements',
            options: [
                {
                    label: 'Требуется',
                    id: 'Требуется',
                },
                {
                    label: 'Не требуется',
                    id: 'Не требуется',
                },
            ],
        },
        {
            type: 'InputText',
            title: 'Номера и наименования этапов строительства',
            incon: '',
            variable: 'numbers_construction_stages',
        },
        {
            type: 'InputText',
            title: 'Пункт 13.2. Проектную документацию разработать в виде отдельных копмлектов',
            incon: '',
            variable: 'design_documentation',
        },
        {
            type: 'TitleItem',
            title: '14. Требования по вариантной разработке',
            icon: '',
            variable: '',
        },
        {
            type: 'selectItem',
            title: '14. Требования по вариантной разработке',
            icon: '',
            variable: 'development_requirements',
            options: [
                {
                    label: 'Требуется',
                    id: 'Требуется',
                },
                {
                    label: 'Не требуется',
                    id: 'Не требуется',
                },
            ],
        },
        {
            type: 'InputText',
            title: 'Наименование вариантной проработки технического решения и количество выполняемых технико-экономических сравнений',
            incon: '',
            variable: 'number_feasibility_comparisons_performed',
        },
        {
            type: 'TitleItem',
            title: '15. Особые условия строительства',
            icon: '',
            variable: '',
        },
        {
            type: 'selectItem',
            title: '15. Особые условия строительства',
            icon: '',
            variable: 'special_construction_conditions',
            options: [
                {
                    label: 'Отсутствуют',
                    id: 'Отсутствуют',
                },
                {
                    label: 'Присутствуют',
                    id: 'Присутствуют',
                },
            ],
        },
        {
            type: 'InputText',
            title: 'Наименование условий',
            incon: '',
            variable: 'name_conditions',
        },
        {
            type: 'TitleItem',
            title: '16. Сведения об объекте капитального строительства по назначению и функционально-технологическим особенностям',
            icon: '',
            variable: '',
        },
        {
            type: 'InputText',
            title: 'Наименование условий',
            incon: '',
            variable: 'name_conditions',
        },
        {
            type: 'InputText',
            title: 'Наименование вида объекта капитального строительства',
            incon: '',
            variable: 'name_capital_construction_object',
        },
        {
            type: 'TitleItem',
            title: '17.1. Генпроектировщику при разработке',
            icon: '',
            variable: '',
        },
        {
            type: 'selectItem',
            title: '17.1. Генпроектировщику при разработке',
            icon: '',
            variable: 'generaldesigner_during_development',
            options: [
                {
                    label: 'ОТР',
                    id: 'ОТР',
                },
                {
                    label: 'Проектной документации',
                    id: 'Проектной документации',
                },
            ],
        },
        {
            type: 'TitleItem',
            title: '18. Требование о необходимости соответствия проектной документации обоснованию безопасности опасного производственного объекта',
            icon: '',
            variable: '',
        },
        {
            type: 'selectItem',
            title: 'Требование о необходимости соответствия проектной документации обоснованию безопасности опасного производственного объекта',
            icon: '',
            variable: 'requirement_need_design_documentation',
            options: [
                {
                    label: 'Не требуется',
                    id: 'Не требуется',
                },
                {
                    label: 'Требуется',
                    id: 'Требуется',
                },
            ],
        },
        {
            type: 'TitleItem',
            title: '19. Объект проектирования соответствует критериям объектов федерального трубопроводного транспорта, подлежащих отображению на СТП РФ, установленным распоряжением Правительства Российской Федерации от 09.02.2012 № 162-р',
            icon: '',
            variable: '',
        },
        {
            type: 'selectItem',
            title: 'Объект проектирования соответствует критериям объектов федерального трубопроводного транспорта, подлежащих отображению на СТП РФ, установленным распоряжением Правительства Российской Федерации от 09.02.2012 № 162-р',
            icon: '',
            variable: 'object_criteria_federal_transport_facilities',
            options: [
                {
                    label: 'Да',
                    id: 'Да',
                },
                {
                    label: 'Нет',
                    id: 'Нет',
                },
            ],
        },
        {
            type: 'TitleItem',
            title: 'Выполнение инженерных изысканий',
            icon: '',
            variable: '',
        },
        {
            type: 'selectItem',
            title: 'Выполнение инженерных изысканий',
            icon: '',
            variable: 'performing_engineering_surveys',
            options: [
                {
                    label: 'Не требуется',
                    id: 'Не требуется',
                },
                {
                    label: 'Требуется',
                    id: 'Требуется',
                },
            ],
        },
        {
            type: 'TitleItem',
            title: '20. Состав ОТР площадочные/линейные объекты',
            icon: '',
            variable: '',
        },
        {
            type: 'selectItem',
            title: 'Состав ОТР площадочные/линейные объекты',
            icon: '',
            variable: 'composition_site_linear_facilities',
            options: [
                {
                    label: 'Площадочные объекты',
                    id: 'Площадочные объекты',
                },
                {
                    label: 'Линейные объекты',
                    id: 'Линейные объекты',
                },
            ],
        },
        {
            type: 'TitleItem',
            title: 'На момент передачи Заказчику/Агенту',
            icon: '',
            variable: '',
        },
        {
            type: 'selectItem',
            title: 'На момент передачи Заказчику/Агенту',
            icon: '',
            variable: 'time_transfer_customer_agent',
            options: [
                {
                    label: 'До проведения государственной экспертизы',
                    id: 'До проведения государственной экспертизы',
                },
                {
                    label: 'Дату заключения договора на подготовку проектной документации',
                    id: 'Дату заключения договора на подготовку проектной документации',
                },
            ],
        },
        {
            type: 'TitleItem',
            title: 'Структурированная система мониторинга и управления инженерными системами зданий и сооружений» (СМИС)',
            icon: '',
            variable: '',
        },
        {
            type: 'selectItem',
            title: 'Структурированная система мониторинга и управления инженерными системами зданий и сооружений» (СМИС)',
            icon: '',
            variable: 'time_transfer_customer_agent',
            options: [
                {
                    label: 'Требуется разработать',
                    id: 'Требуется разработать',
                },
                {
                    label: 'Не требуется разработать',
                    id: 'Не требуется разработать',
                },
            ],
        },
        {
            type: 'TitleItem',
            title: 'Мероприятия по техническому обслуживанию и ремонту оборудования» (ТОР)',
            icon: '',
            variable: '',
        },
        {
            type: 'selectItem',
            title: 'Мероприятия по техническому обслуживанию и ремонту оборудования» (ТОР)',
            icon: '',
            variable: 'measures_maintenance_repair_equipment',
            options: [
                {
                    label: 'Требуется разработать',
                    id: 'Требуется разработать',
                },
                {
                    label: 'Не требуется разработать',
                    id: 'Не требуется разработать',
                },
            ],
        },
        {
            type: 'TitleItem',
            title: 'Мероприятия по противодействию терроризму» (МПТ)',
            icon: '',
            variable: '',
        },
        {
            type: 'selectItem',
            title: 'Мероприятия по противодействию терроризму» (МПТ)',
            icon: '',
            variable: 'measures_counter_terrorism',
            options: [
                {
                    label: 'Требуется разработать',
                    id: 'Требуется разработать',
                },
                {
                    label: 'Не требуется разработать',
                    id: 'Не требуется разработать',
                },
            ],
        },
        {
            type: 'InputText',
            title: 'Иные разделы',
            incon: '',
            variable: 'other_sections',
        },
        {
            type: 'TitleItem',
            title: '21. Размещение объекта проектирования в Арктической зоне Российской Федерации',
            icon: '',
            variable: '',
        },
        {
            type: 'selectItem',
            title: 'Размещение объекта проектирования в Арктической зоне Российской Федерации',
            icon: '',
            variable: 'composition_site_linear_facilities',
            options: [
                {
                    label: 'Да',
                    id: 'Да',
                },
                {
                    label: 'Нет',
                    id: 'Нет',
                },
            ],
        },
        {
            type: 'TitleItem',
            title: '22.2. Основные технико-стоимостные показатели определить в проектной документации.',
            icon: '',
            variable: '',
        },
        {
            type: 'selectItem',
            title: '22.2. Основные технико-стоимостные показатели определить в проектной документации.',
            icon: '',
            variable: 'technical_indicators_determined_project_documentation',
            options: [
                {
                    label: 'Применять',
                    id: 'Применять',
                },
                {
                    label: 'Не применять',
                    id: 'Не применять',
                },
            ],
        },
        {
            type: 'TitleItem',
            title: 'Технико-экономическая часть. Оценка эффективности инвестиций',
            icon: '',
            variable: '',
        },
        {
            type: 'selectItem',
            title: 'Технико-экономическая часть. Оценка эффективности инвестиций',
            icon: '',
            variable: 'technical_economic_part',
            options: [
                {
                    label: 'Предусмотрена',
                    id: 'Предусмотрена',
                },
                {
                    label: 'Не предусмотрена',
                    id: 'Не предусмотрена',
                },
            ],
        },
        {
            type: 'TitleItem',
            title: '24. Особые требования к проектированию',
            icon: '',
            variable: '',
        },
        {
            type: 'InputText',
            title: 'Наименование застройщика',
            incon: '',
            variable: 'developer_name',
        },
        {
            type: 'selectItem',
            title: 'Категория объектов',
            icon: '',
            variable: 'object_category',
            options: [
                {
                    label: 'I',
                    id: 'I',
                },
                {
                    label: 'II',
                    id: 'II',
                },
                {
                    label: 'III',
                    id: 'III',
                },
                {
                    label: 'IV',
                    id: 'IV',
                },
            ],
        },
        {
            type: 'InputText',
            title: 'Номер подпункта Критериев отнесения объектов',
            icon: '',
            variable: 'subparagraph_number_Criteria_assigning_objects',
        },
        {
            type: 'InputText',
            title: 'Номер пункта Критериев отнесения объектов',
            icon: '',
            variable: 'item_number_Criteria_assigning_objects',
        },
        {
            type: 'TitleItem',
            title: '25. Требования к технологии, режиму предприятия и основному оборудованию',
            icon: '',
            variable: '',
        },
        {
            type: 'InputText',
            title: 'режим работы предприятия',
            icon: '',
            variable: 'business_hours',
        },
        {
            type: 'selectItem',
            title: '25.3. Предусмотреть возможность подключения оборудования для продувки газовых коммуникаций азотом на период проведения ремонтных работ',
            incon: '',
            variable: 'Provide_possibility_connecting_equipment',
            options: [
                {
                    label: 'Применять',
                    id: 'Применять',
                },
                {
                    label: 'Не применять',
                    id: 'Не применять',
                },
            ],
        },
        {
            type: 'TitleItem',
            title: '25.5. На площадках и крановых узлах линейной части, расположенных в низинах и заболоченных местах, предусмотреть использование технологии водопонижения.',
            icon: '',
            variable: '',
        },
        {
            type: 'selectItem',
            title: '25.5. На площадках и крановых узлах линейной части, расположенных в низинах и заболоченных местах, предусмотреть использование технологии водопонижения.',
            incon: '',
            variable: 'provide_dewatering_technology',
            options: [
                {
                    label: 'Применять',
                    id: 'Применять',
                },
                {
                    label: 'Не применять',
                    id: 'Не применять',
                },
            ],
        },
        {
            type: 'TitleItem',
            title: '25.13. В комплект проектной документации включать справку с обоснованием необходимости/отсутствия необходимости создания стационарного объекта газозаправочной инфраструктуры КПГ (АГНКС) на проектируемом объекте.',
            icon: '',
            variable: '',
        },
        {
            type: 'selectItem',
            title: '25.13. В комплект проектной документации включать справку с обоснованием необходимости/отсутствия необходимости создания стационарного объекта газозаправочной инфраструктуры КПГ (АГНКС) на проектируемом объекте.',
            incon: '',
            variable: 'filling_infrastructure_facility_being_designed',
            options: [
                {
                    label: 'Применять',
                    id: 'Применять',
                },
                {
                    label: 'Не применять',
                    id: 'Не применять',
                },
            ],
        },
        {
            type: 'TitleItem',
            title: '27. Требования к архитектурно-планировочным, конструктивным решениям',
            icon: '',
            variable: '',
        },
        {
            type: 'TitleItem',
            title: '27.5. Состав и размещение помещений лечебных подразделений для медицинского обеспечения работников выполнить в соответствии с Приложением В СП 158.13330.2014 «Здания и помещения медицинских организаций. Правила проектирования»',
            icon: '',
            variable: '',
        },
        {
            type: 'selectItem',
            title: '27.5. Состав и размещение помещений лечебных подразделений для медицинского обеспечения работников выполнить в соответствии с Приложением В СП 158.13330.2014 «Здания и помещения медицинских организаций. Правила проектирования»',
            icon: '',
            variable: 'composition_placement_premises_medical_units',
            options: [
                {
                    label: 'Применять',
                    id: 'Применять',
                },
                {
                    label: 'Не применять',
                    id: 'Не применять',
                },
            ],
        },
        {
            type: 'TitleItem',
            title: '27.6. На этапе ОТР запросить у Заказчика/Агента (лишнее исключить) согласованный с ПАО «Газпром» состав помещений для физкультурно-оздоровительного обеспечения работников в соответствии с СП 31-112-2004 Часть 1 и Часть 2 «Физкультурно-спортивные залы».',
            icon: '',
            variable: '',
        },
        {
            type: 'selectItem',
            title: '27.6. На этапе ОТР запросить у Заказчика/Агента (лишнее исключить) согласованный с ПАО «Газпром» состав помещений для физкультурно-оздоровительного обеспечения работников в соответствии с СП 31-112-2004 Часть 1 и Часть 2 «Физкультурно-спортивные залы».',
            icon: '',
            variable: 'request_Customer_Agent_agreed',
            options: [
                {
                    label: 'Применять',
                    id: 'Применять',
                },
                {
                    label: 'Не применять',
                    id: 'Не применять',
                },
            ],
        },
        {
            type: 'TitleItem',
            title: '27.7. На этапе ОТР согласовать с Заказчиком/Агентом (лишнее исключить) и ПАО «Газпром» принцип работы и количество посадочных мест на предприятиях общественного питания в соответствии с п. 5.50 СП 44.13330.2011 «Административные и бытовые здания. Актуализированная редакция СНиП 2.09.04-87».',
            icon: '',
            variable: '',
        },
        {
            type: 'selectItem',
            title: '27.7. На этапе ОТР согласовать с Заказчиком/Агентом (лишнее исключить) и ПАО «Газпром» принцип работы и количество посадочных мест на предприятиях общественного питания в соответствии с п. 5.50 СП 44.13330.2011 «Административные и бытовые здания. Актуализированная редакция СНиП 2.09.04-87».',
            icon: '',
            variable: 'agree_Customer_Agent_PJSC_Gazprom_principle_operation',
            options: [
                {
                    label: 'Применять',
                    id: 'Применять',
                },
                {
                    label: 'Не применять',
                    id: 'Не применять',
                },
            ],
        },
        {
            type: 'TitleItem',
            title: '27.9. Для архитектурно-значимых зданий, строений и сооружений объекта проектирования',
            icon: '',
            variable: '',
        },
        {
            type: 'selectItem',
            title: '27.9. Для архитектурно-значимых зданий, строений и сооружений объекта проектирования',
            icon: '',
            variable: 'architecturally_significant_buildings',
            options: [
                {
                    label: 'Применять',
                    id: 'Применять',
                },
                {
                    label: 'Не применять',
                    id: 'Не применять',
                },
            ],
        },
        {
            type: 'TitleItem',
            title: '28. Использование зданий комплектной поставки',
            icon: '',
            variable: '',
        },
        {
            type: 'selectItem',
            title: 'Использование зданий комплектной поставки',
            icon: '',
            variable: 'buildings_complete_delivery',
            options: [
                {
                    label: 'Требуется',
                    id: 'Требуется',
                },
                {
                    label: 'Не требуется',
                    id: 'Не требуется',
                },
            ],
        },
        {
            type: 'TitleItem',
            title: '29. Требования и условия к разработке природоохранных мероприятий',
            icon: '',
            variable: '',
        },
        {
            type: 'selectItem',
            title: 'Использование зданий комплектной поставки',
            icon: '',
            variable: 'buildings_complete_delivery',
            options: [
                {
                    label: 'Требуется',
                    id: 'Требуется',
                },
                {
                    label: 'Не требуется',
                    id: 'Не требуется',
                },
            ],
        },
        {
            type: 'TitleItem',
            title: '30. Технологическая связь',
            icon: '',
            variable: '',
        },
        {
            type: 'TitleItem',
            title: '31. Энергоснабжение',
            icon: '',
            variable: '',
        },
        {
            type: 'TitleItem',
            title: '32. Требования к защите от коррозии',
            icon: '',
            variable: '',
        },
        {
            type: 'TitleItem',
            title: '33. Пункт применяется, если в документе приводятся сведения о разработке технических заданий, технических требований на создание информационных систем, автоматизированных систем управления, систем автоматического управления',
            icon: '',
            variable: '',
        },
        {
            type: 'selectItem',
            title: 'Пункт применяется, если в документе приводятся сведения о разработке технических заданий, технических требований на создание информационных систем, автоматизированных систем управления, систем автоматического управления',
            icon: '',
            variable: 'item_applies',
            options: [
                {
                    label: 'Применяется',
                    id: 'Применяется',
                },
                {
                    label: 'Не применяется',
                    id: 'Не применяется',
                },
            ],
        },
        {
            type: 'TitleItem',
            title: 'Пункт применяется для объектов, в составе которых создается объект (объекты) критической информационной инфраструктуры с определенной Заказчиком/Агентом категорией значимости',
            icon: '',
            variable: '',
        },
        {
            type: 'selectItem',
            title: 'Пункт применяется для объектов, в составе которых создается объект (объекты) критической информационной инфраструктуры с определенной Заказчиком/Агентом категорией значимости',
            icon: '',
            variable: 'item_applies_objects',
            options: [
                {
                    label: 'Применяется',
                    id: 'Применяется',
                },
                {
                    label: 'Не применяется',
                    id: 'Не применяется',
                },
            ],
        },
        {
            type: 'TitleItem',
            title: '34. Метрологическое обеспечение и организация измерений углеводородных сред',
            icon: '',
            variable: '',
        },
        {
            type: 'selectItem',
            title: 'Метрологическое обеспечение и организация измерений углеводородных сред',
            icon: '',
            variable: 'metrological_support_organization_measurements_hydrocarbon_media',
            options: [
                {
                    label: 'Требуется',
                    id: 'Требуется',
                },
                {
                    label: 'Не требуется',
                    id: 'Не требуется',
                },
            ],
        },
        {
            type: 'TitleItem',
            title: 'Метрологическое обеспечение',
            icon: '',
            variable: '',
        },
        {
            type: 'selectItem',
            title: 'Метрологическое обеспечение',
            icon: '',
            variable: 'metrological_support_1',
            options: [
                {
                    label: 'и организация измерений углеводородных сред',
                    id: 'и организация измерений углеводородных сред',
                },
                {
                    label: 'и организация измерений природного газа',
                    id: 'и организация измерений природного газа',
                },
            ],
        },
        {
            type: 'TitleItem',
            title: 'Метрологического обеспечения',
            icon: '',
            variable: '',
        },
        {
            type: 'selectItem',
            title: 'Метрологического обеспечения',
            icon: '',
            variable: 'metrological_support_2',
            options: [
                {
                    label: 'и организации измерений количества и показателей качества углеводородных сред',
                    id: 'и организации измерений количества и показателей качества углеводородных сред',
                },
                {
                    label: 'и организации измерений количества и показателей качества природного газа',
                    id: 'и организации измерений количества и показателей качества природного газа',
                },
            ],
        },
    ],
};

//-----------------------------------------------------------------old stracture
export const _stracture = {
    type: 'Start',
    variable: 'types_jobs',
    children: [
        {
            type: 'stepItem',
            title: 'Виды работ',
            icon: 1,
            variable: 'types_jobs',
            child: [],
            children: [
                {
                    type: 'collapseItem',
                    title: 'Общие характеристики проекта',
                    icon: 'icon-development',
                    variable: 'project_characteristics',
                    children: [
                        {
                            type: 'selectItem',
                            title: 'Вид строительства',
                            icon: '',
                            variable: 'construction_type',
                            options: 'construction_types',
                        },
                        {
                            type: 'selectItem',
                            title: 'Тип разработки',
                            icon: '',
                            variable: 'development_type',
                            options: 'development_types',
                        },
                        {
                            type: 'selectItem',
                            title: 'Направление проектирования',
                            icon: '',
                            variable: 'design_direction',
                            options: 'design_directions',
                        },
                    ],
                },
                {
                    type: 'collapseItem',
                    title: 'Сбор исходных данных',
                    icon: 'icon-download',
                    variable: 'collection_initial_data',
                    children: [
                        {
                            type: 'stageItem',
                            title: 'СИД 1 этап',
                            icon: '',
                            variable: 'idc_one',
                            children: [
                                {
                                    type: 'percentItem',
                                    title: '% выполнения работ собственными силамих',
                                    icon: '',
                                    variable: 'in_house_percentage',
                                },
                                {
                                    type: 'percentItem',
                                    title: '% выполнения работ субподряд',
                                    icon: '',
                                    variable: 'subcontracting_percentage',
                                },
                                {
                                    type: 'checkboxItem',
                                    title: 'Объект располагается на территории Южного федерального округа',
                                    icon: '',
                                    variable: 'is_southern_federal_district',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Количество Федеральных образований',
                                    icon: '',
                                    variable: 'federal_entities',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Количество Субъектов Федерации',
                                    icon: '',
                                    variable: 'federal_subjects',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Количество Муниципальных образований',
                                    icon: '',
                                    variable: 'municipalities',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Количество кадастровых планов территории',
                                    icon: '',
                                    variable: 'cadastral_plan',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Количество сельских и городских поселений',
                                    icon: '',
                                    variable: 'settlements',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Количество подключений',
                                    icon: '',
                                    variable: 'connections',
                                },
                            ],
                        },
                        {
                            type: 'stageItem',
                            title: 'СИД 2 этап',
                            icon: '',
                            variable: 'idc_two',
                            children: [
                                {
                                    type: 'percentItem',
                                    title: '% выполнения работ собственными силамих',
                                    icon: '',
                                    variable: 'in_house_percentage',
                                },
                                {
                                    type: 'percentItem',
                                    title: '% выполнения работ субподряд',
                                    icon: '',
                                    variable: 'subcontracting_percentage',
                                },
                                {
                                    type: 'checkboxItem',
                                    title: 'Объект располагается на территории Южного федерального округа',
                                    icon: '',
                                    variable: 'is_southern_federal_district',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Количество Федеральных образований',
                                    icon: '',
                                    variable: 'federal_entities',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Количество Субъектов Федерации',
                                    icon: '',
                                    variable: 'federal_subjects',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Количество Муниципальных образований',
                                    icon: '',
                                    variable: 'municipalities',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Количество кадастровых планов территории',
                                    icon: '',
                                    variable: 'cadastral_plan',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Количество сельских и городских поселений',
                                    icon: '',
                                    variable: 'settlements',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Объект располагается на территории Южного федерального округа',
                                    icon: '',
                                    variable: 'is_southern_federal_district',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Количество подключений',
                                    icon: '',
                                    variable: 'connections',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Количество ЗОУИТ',
                                    icon: '',
                                    variable: 'ZOUIT_quantity',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Количество чертежей в томе 2',
                                    icon: '',
                                    variable: 'plot_volume_two',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Количество чертежей в томе 4',
                                    icon: '',
                                    variable: 'plot_volume_four',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Количество чертежей в томе 6',
                                    icon: '',
                                    variable: 'plot_volume_six',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Количество чертежей в томе 7',
                                    icon: '',
                                    variable: 'plot_volume_seven',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Количество проектов ДПТ',
                                    icon: '',
                                    variable: 'territory_projects',
                                },
                            ],
                        },
                        {
                            type: 'stageItem',
                            title: 'СИД 2 этап. Логистическое обеспечение',
                            icon: '',
                            variable: 'LED_stage_2_Logistics',
                            children: [
                                {
                                    type: 'percentItem',
                                    title: '% выполнения работ собственными силамих',
                                    icon: '',
                                    variable: 'in_house_percentage',
                                },
                                {
                                    type: 'percentItem',
                                    title: '% выполнения работ субподряд',
                                    icon: '',
                                    variable: 'subcontracting_percentage',
                                },
                                {
                                    type: 'checkboxItem',
                                    title: 'Объект располагается на территории Южного федерального округа',
                                    icon: '',
                                    variable: 'is_southern_federal_district',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Количество Федеральных образований',
                                    icon: '',
                                    variable: 'federal_entities',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Количество Субъектов Федерации',
                                    icon: '',
                                    variable: 'federal_subjects',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Количество Муниципальных образований',
                                    icon: '',
                                    variable: 'municipalities',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Количество кадастровых планов территории',
                                    icon: '',
                                    variable: 'cadastral_plan',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Количество сельских и городских поселений',
                                    icon: '',
                                    variable: 'settlements',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Объект располагается на территории Южного федерального округа',
                                    icon: '',
                                    variable: 'is_southern_federal_district',
                                },
                            ],
                        },
                        {
                            type: 'stageItem',
                            title: 'СИД 3 этап',
                            icon: '',
                            variable: 'LED_3_stage',
                            children: [
                                {
                                    type: 'percentItem',
                                    title: '% выполнения работ собственными силамих',
                                    icon: '',
                                    variable: 'in_house_percentage',
                                },
                                {
                                    type: 'percentItem',
                                    title: '% выполнения работ субподряд',
                                    icon: '',
                                    variable: 'subcontracting_percentage',
                                },
                                {
                                    type: 'checkboxItem',
                                    title: 'Объект располагается на территории Южного федерального округа',
                                    icon: '',
                                    variable: 'is_southern_federal_district',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Количество Федеральных образований',
                                    icon: '',
                                    variable: 'federal_entities',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Количество Субъектов Федерации',
                                    icon: '',
                                    variable: 'federal_subjects',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Количество Муниципальных образований',
                                    icon: '',
                                    variable: 'municipalities',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Количество кадастровых планов территории',
                                    icon: '',
                                    variable: 'cadastral_plan',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Количество сельских и городских поселений',
                                    icon: '',
                                    variable: 'settlements',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Объект располагается на территории Южного федерального округа',
                                    icon: '',
                                    variable: 'is_southern_federal_district',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Количество подключений',
                                    icon: '',
                                    variable: 'connections',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Количество ЗОУИТ',
                                    icon: '',
                                    variable: 'ZOUIT_quantity',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Количество чертежей в томе 2',
                                    icon: '',
                                    variable: 'plot_volume_two',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Количество чертежей в томе 4',
                                    icon: '',
                                    variable: 'plot_volume_four',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Количество чертежей в томе 6',
                                    icon: '',
                                    variable: 'plot_volume_six',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Количество чертежей в томе 7',
                                    icon: '',
                                    variable: 'plot_volume_seven',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Количество проектов ДПТ',
                                    icon: '',
                                    variable: 'territory_projects',
                                },
                            ],
                        },
                        {
                            type: 'stageItem',
                            title: 'Оформление прав на земельные участки',
                            icon: '',
                            variable: 'land_rights_registration',
                            children: [
                                {
                                    type: 'percentItem',
                                    title: '% выполнения работ собственными силамих',
                                    icon: '',
                                    variable: 'in_house_percentage',
                                },
                                {
                                    type: 'percentItem',
                                    title: '% выполнения работ субподряд',
                                    icon: '',
                                    variable: 'subcontracting_percentage',
                                },
                                {
                                    type: 'checkboxItem',
                                    title: 'Объект располагается на территории Южного федерального округа',
                                    icon: '',
                                    variable: 'is_southern_federal_district',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Количество Субъектов Федерации',
                                    icon: '',
                                    variable: 'federal_subjects',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Количество Муниципальных образований',
                                    icon: '',
                                    variable: 'municipalities',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Площадь ',
                                    icon: '',
                                    variable: 'area',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Количество участков',
                                    icon: '',
                                    variable: 'land_plots_count',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Количество участков на землях ГЛФ',
                                    icon: '',
                                    variable: 'sff_land_plots_count',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Количество землепользователей',
                                    icon: '',
                                    variable: 'land_users',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Площадь на землях ГЛФ',
                                    icon: '',
                                    variable: 'sff_lands_area',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Протяженность',
                                    icon: '',
                                    variable: 'length',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Протяженность по землям ГЛФ',
                                    icon: '',
                                    variable: 'sff_lands_length',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Количество вариантов разрабатываемых по отдельным заданиям',
                                    icon: '',
                                    variable: 'variants_per_task',
                                },
                            ],
                        },
                    ],
                },
                {
                    type: 'collapseItem',
                    title: 'Инженерные изыскания',
                    icon: 'icon-search',
                    variable: 'engineeringSurvey',
                    child: [],
                    children: [
                        {
                            type: 'stageItem',
                            title: 'Инженерно-геодезические изыскания',
                            icon: '',
                            variable: 'geodetic',
                            children: [
                                {
                                    type: 'percentItem',
                                    title: '% выполнения работ собственными силамих',
                                    icon: '',
                                    variable: 'in_house_percentage',
                                    child: [],
                                    children: [],
                                },
                                {
                                    type: 'percentItem',
                                    title: '% выполнения работ субподряд',
                                    icon: '',
                                    variable: 'subcontracting_percentage',
                                },
                                {
                                    type: 'checkboxItem',
                                    title: 'Объект располагается на территории Южного федерального округа',
                                    icon: '',
                                    variable: 'is_southern_federal_district',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Протяженность трассы изысканий для линейных объектов',
                                    icon: '',
                                    variable: 'survey_lines_length',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Закладка ПОГС ',
                                    icon: '',
                                    variable: 'pogc_laying',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Определение ПОГС',
                                    icon: '',
                                    variable: 'pogc_definition',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Трассирование',
                                    icon: '',
                                    variable: 'tracing',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Инженерно-топографическая съемка М 1:500 ',
                                    icon: '',
                                    variable: 'ets_m_500',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Инженерно-топографическая съемка М 1:1000',
                                    icon: '',
                                    variable: 'ets_m_1000',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Инженерно-топографическая съемка М 1:2000 ',
                                    icon: '',
                                    variable: 'ets_m_2000',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Инженерно-топографическая съемка М 1:5000',
                                    icon: '',
                                    variable: 'ets_m_5000',
                                },
                            ],
                        },
                        {
                            type: 'stageItem',
                            title: 'Инженерно-геологические изыскания',
                            icon: '',
                            variable: 'geological',
                            children: [
                                {
                                    type: 'percentItem',
                                    title: '% выполнения работ собственными силамих',
                                    icon: '',
                                    variable: 'in_house_percentage',
                                },
                                {
                                    type: 'percentItem',
                                    title: '% выполнения работ субподряд',
                                    icon: '',
                                    variable: 'subcontracting_percentage',
                                },
                                {
                                    type: 'checkboxItem',
                                    title: 'Объект располагается на территории Южного федерального округа',
                                    icon: '',
                                    variable: 'is_southern_federal_district',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Протяженность трассы изысканий для линейных объектов',
                                    icon: '',
                                    variable: 'survey_lines_length',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Инженерно-геологическая рекогносцировка',
                                    icon: '',
                                    variable: 'eg_reconnaissance',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Проходка горных выработок',
                                    icon: '',
                                    variable: 'mining',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Испытание грунтов на срез в горных выработках',
                                    icon: '',
                                    variable: 'shear_testing_of_soils',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Испытания грунтов вертикальной статической нагрузкой на штампы',
                                    icon: '',
                                    variable: 'vertical_static_load_tests',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Проведение полевых испытаний крыльчаткой сдвигомером',
                                    icon: '',
                                    variable: 'vane_shear_gauge_testing',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Статическое зондирование грунтов',
                                    icon: '',
                                    variable: 'static_sounding',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Динамическое зондирование грунтов',
                                    icon: '',
                                    variable: 'dynamic_sounding',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Лабораторные работы',
                                    icon: '',
                                    variable: 'laboratory',
                                },
                            ],
                        },
                        {
                            type: 'stageItem',
                            title: 'Инженерно-геофизические изыскания',
                            icon: '',
                            variable: 'geophysical',
                            children: [
                                {
                                    type: 'percentItem',
                                    title: '% выполнения работ собственными силамих',
                                    icon: '',
                                    variable: 'in_house_percentage',
                                },
                                {
                                    type: 'percentItem',
                                    title: '% выполнения работ субподряд',
                                    icon: '',
                                    variable: 'subcontracting_percentage',
                                },
                                {
                                    type: 'checkboxItem',
                                    title: 'Объект располагается на территории Южного федерального округа',
                                    icon: '',
                                    variable: 'is_southern_federal_district',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Протяженность трассы изысканий для линейных объектов',
                                    icon: '',
                                    variable: 'survey_lines_length',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Определение УЭС и КА',
                                    icon: '',
                                    variable: 'resistivity_and_ka',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Сейсморазведка МПВ',
                                    icon: '',
                                    variable: 'seismic_exploration',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Электроразведка ВЭЗ до глубины 200 м',
                                    icon: '',
                                    variable: 'ves_exploration_lt_200',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Электроразведка ЕП',
                                    icon: '',
                                    variable: 'electrical_prospecting_ep',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Регистрация фона высокочастотных микросейсм (3 компоненты) ',
                                    icon: '',
                                    variable: 'hf_microseisms_registration',
                                },
                            ],
                        },
                        {
                            type: 'stageItem',
                            title: 'Инженерно-экологические изыскания',
                            icon: '',
                            variable: 'ecological',
                            children: [
                                {
                                    type: 'percentItem',
                                    title: '% выполнения работ собственными силамих',
                                    icon: '',
                                    variable: 'in_house_percentage',
                                },
                                {
                                    type: 'percentItem',
                                    title: '% выполнения работ субподряд',
                                    icon: '',
                                    variable: 'subcontracting_percentage',
                                },
                                {
                                    type: 'checkboxItem',
                                    title: 'Объект располагается на территории Южного федерального округа',
                                    icon: '',
                                    variable: 'is_southern_federal_district',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Протяженность трассы изысканий для линейных объектов',
                                    icon: '',
                                    variable: 'survey_lines_length',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Лабораторные работы',
                                    icon: '',
                                    variable: 'laboratories',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Комплексное инженерно-экологическое маршрутное обследование линейных объектов ',
                                    icon: '',
                                    variable: 'linear_facilities_inspection',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Комплексное инженерно-экологическое маршрутное обследование площадочных объектов ',
                                    icon: '',
                                    variable: 'site_facilities_inspection',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Детальные наблюдения на площадках комплексных описаний ландшафтов (ПКОЛ)',
                                    icon: '',
                                    variable: 'pkol_observations',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Определение плотности потока радона',
                                    icon: '',
                                    variable: 'radon_flux_density',
                                },
                            ],
                        },
                        {
                            type: 'stageItem',
                            title: 'Инженерно-гидрометеорологические изыскания',
                            icon: '',
                            variable: 'hydrometeorological',
                            child: [],
                            children: [
                                {
                                    type: 'percentItem',
                                    title: '% выполнения работ собственными силамих',
                                    icon: '',
                                    variable: 'in_house_percentage',
                                },
                                {
                                    type: 'percentItem',
                                    title: '% выполнения работ субподряд',
                                    icon: '',
                                    variable: 'subcontracting_percentage',
                                },
                                {
                                    type: 'checkboxItem',
                                    title: 'Объект располагается на территории Южного федерального округа',
                                    icon: '',
                                    variable: 'is_southern_federal_district',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Протяженность трассы изысканий для линейных объектов',
                                    icon: '',
                                    variable: 'survey_lines_length',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Рекогносцировочное обследование ',
                                    icon: '',
                                    variable: 'reconnaissance_survey',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Переход временного водотока, лощины или пади',
                                    icon: '',
                                    variable: 'temporary_stream_transition',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Переход/подход постоянного водотока',
                                    icon: '',
                                    variable: 'permanent_stream_transition',
                                },
                            ],
                        },
                        {
                            type: 'stageItem',
                            title: 'Обследование на территории на предмет наличия ВОП',
                            icon: '',
                            variable: 'explosive_objects_presence',
                            child: [],
                            children: [
                                {
                                    type: 'percentItem',
                                    title: '% выполнения работ собственными силамих',
                                    icon: '',
                                    variable: 'in_house_percentage',
                                },
                                {
                                    type: 'percentItem',
                                    title: '% выполнения работ субподряд',
                                    icon: '',
                                    variable: 'subcontracting_percentage',
                                },
                                {
                                    type: 'checkboxItem',
                                    title: 'Объект располагается на территории Южного федерального округа',
                                    icon: '',
                                    variable: 'is_southern_federal_district',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Рекогносцировочное обследование',
                                    icon: '',
                                    variable: 'reconnaissance_survey',
                                },
                            ],
                        },
                        {
                            type: 'stageItem',
                            title: 'Археологические исследования',
                            icon: '',
                            variable: 'archaeological',
                            child: [],
                            children: [
                                {
                                    type: 'percentItem',
                                    title: '% выполнения работ собственными силамих',
                                    icon: '',
                                    variable: 'in_house_percentage',
                                },
                                {
                                    type: 'percentItem',
                                    title: '% выполнения работ субподряд',
                                    icon: '',
                                    variable: 'subcontracting_percentage',
                                },
                                {
                                    type: 'checkboxItem',
                                    title: 'Объект располагается на территории Южного федерального округа',
                                    icon: '',
                                    variable: 'is_southern_federal_district',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Рекогносцировочное обследование',
                                    icon: '',
                                    variable: 'reconnaissance_survey',
                                },
                            ],
                        },
                    ],
                },
                {
                    type: 'collapseItem',
                    title: 'Проектная документация',
                    icon: 'icon-project-document',
                    variable: 'project_documentation',
                    child: [],
                    children: [
                        {
                            type: 'percentItem',
                            title: '% выполнения работ собственными силамих',
                            icon: '',
                            variable: 'in_house_percentage',
                        },
                        {
                            type: 'percentItem',
                            title: '% выполнения работ субподряд',
                            icon: '',
                            variable: 'subcontracting_percentage',
                        },
                        {
                            type: 'checkboxItem',
                            title: 'Объект располагается на территории Южного федерального округа',
                            icon: '',
                            variable: 'is_southern_federal_district',
                        },
                        {
                            type: 'numberItem',
                            title: 'Протяженность линейной части',
                            icon: '',
                            variable: 'length_linear_part',
                        },
                        {
                            type: 'numberItem',
                            title: 'Количество ГПА',
                            icon: '',
                            variable: 'number_GPU',
                        },
                        {
                            type: 'numberItem',
                            title: 'Единичная мощность мощность',
                            icon: '',
                            variable: 'unit_power_power',
                        },
                        {
                            type: 'numberItem',
                            title: 'Количество ЛПУ МГ',
                            icon: '',
                            variable: 'mumber_medical_facilities_MG',
                        },
                    ],
                },
                {
                    type: 'collapseItem',
                    title: 'Рабочая документация',
                    icon: 'icon-pen-documnet',
                    variable: '',
                    child: [],
                    children: [
                        {
                            type: 'percentItem',
                            title: '% выполнения работ собственными силамих',
                            icon: '',
                            variable: 'in_house_percentage',
                        },
                        {
                            type: 'percentItem',
                            title: '% выполнения работ субподряд',
                            icon: '',
                            variable: 'subcontracting_percentage',
                        },
                        {
                            type: 'checkboxItem',
                            title: 'Объект располагается на территории Южного федерального округа',
                            icon: '',
                            variable: 'is_southern_federal_district',
                        },
                        {
                            type: 'numberItem',
                            title: 'Протяженность линейной части',
                            icon: '',
                            variable: 'length_linear_part',
                        },
                        {
                            type: 'numberItem',
                            title: 'Количество ГПА',
                            icon: '',
                            variable: 'number_GPU',
                        },
                        {
                            type: 'numberItem',
                            title: 'Единичная мощность мощность',
                            icon: '',
                            variable: 'unit_power_power',
                        },
                        {
                            type: 'numberItem',
                            title: 'Количество ЛПУ МГ',
                            icon: '',
                            variable: 'mumber_medical_facilities_MG',
                        },
                    ],
                },
                {
                    type: 'collapseItem',
                    title: 'Разработка ТЧДЗ',
                    icon: 'icon-settings',
                    variable: 'development_PTSD',
                    child: [],
                    children: [
                        {
                            type: 'checkboxItem',
                            title: 'Да',
                            icon: '',
                            variable: 'yes',
                        },
                        {
                            type: 'checkboxItem',
                            title: 'Нет',
                            icon: '',
                            variable: 'no',
                        },
                    ],
                },
                {
                    type: 'collapseItem',
                    title: 'Разработка ОТР (вне комплекса)',
                    icon: 'icon-development',
                    variable: 'OTR_development',
                    child: [],
                    children: [
                        {
                            type: 'checkboxItem',
                            title: 'Да',
                            icon: '',
                            variable: 'yes',
                        },
                        {
                            type: 'checkboxItem',
                            title: 'Нет',
                            icon: '',
                            variable: 'no',
                        },
                    ],
                },
            ],
        },
        {
            type: 'stepItemTree',
            title: 'Дерево объектов',
            icon: 2,
            variable: 'objects',
            child: null,
            children: [
                {
                    type: 'objectName',
                    title: 'Дерево объектов',
                    icon: '2',
                    variable: 'name',
                },
                {
                    type: 'collapseItem',
                    title: 'Технические характеристики',
                    icon: 'icon-characteristics',
                    variable: 'specifications',
                    children: [
                        {
                            type: 'ListWithAddAndRemove',
                            title: 'Добавить новую характеристику',
                            icon: '2',
                            variable: '',
                            child: {
                                type: 'SelectWithValue',
                                title: 'Дерево объектов',
                                icon: '2',
                                variable: '',
                            },
                        },
                    ],
                },
                {
                    type: 'ButtonForAdd',
                    title: 'Добавить особые условия проектирования',
                    subTitle: 'Особые условия',
                    icon: '2',
                    variable: '',
                    child: {
                        type: 'collapseItem',
                        title: 'Сбор исходных данных',
                        icon: 'icon-download',
                        variable: '',
                        child: [],
                        children: [
                            {
                                type: 'stageItem',
                                title: 'СИД 1 этап',
                                icon: '',
                                variable: 'idc_one',
                                child: [],
                                children: [
                                    {
                                        type: 'percentItem',
                                        title: '% выполнения работ собственными силамих',
                                        icon: '',
                                        variable: 'in_house_percentage',
                                    },
                                    {
                                        type: 'percentItem',
                                        title: '% выполнения работ субподряд',
                                        icon: '',
                                        variable: 'subcontracting_percentage',
                                    },
                                    {
                                        type: 'checkboxItem',
                                        title: 'Объект располагается на территории Южного федерального округа',
                                        icon: '',
                                        variable:
                                            'is_southern_federal_district',
                                    },
                                    {
                                        type: 'numberItem',
                                        title: 'Количество Федеральных образований',
                                        icon: '',
                                        variable: 'federal_entities',
                                    },
                                    {
                                        type: 'numberItem',
                                        title: 'Количество Субъектов Федерации',
                                        icon: '',
                                        variable: 'federal_subjects',
                                    },
                                    {
                                        type: 'numberItem',
                                        title: 'Количество Муниципальных образований',
                                        icon: '',
                                        variable: 'municipalities',
                                    },
                                    {
                                        type: 'numberItem',
                                        title: 'Количество кадастровых планов территории',
                                        icon: '',
                                        variable: 'cadastral_plan',
                                    },
                                    {
                                        type: 'numberItem',
                                        title: 'Количество сельских и городских поселений',
                                        icon: '',
                                        variable: 'settlements',
                                    },
                                    {
                                        type: 'numberItem',
                                        title: 'Объект располагается на территории Южного федерального округа',
                                        icon: '',
                                        variable:
                                            'is_southern_federal_district',
                                    },
                                    {
                                        type: 'numberItem',
                                        title: 'Количество подключений',
                                        icon: '',
                                        variable: 'connections',
                                    },
                                ],
                            },
                            {
                                type: 'stageItem',
                                title: 'СИД 2 этап',
                                icon: '',
                                variable: 'idc_two',
                                child: [],
                                children: [
                                    {
                                        type: 'percentItem',
                                        title: '% выполнения работ собственными силамих',
                                        icon: '',
                                        variable: 'in_house_percentage',
                                    },
                                    {
                                        type: 'percentItem',
                                        title: '% выполнения работ субподряд',
                                        icon: '',
                                        variable: 'subcontracting_percentage',
                                    },
                                    {
                                        type: 'checkboxItem',
                                        title: 'Объект располагается на территории Южного федерального округа',
                                        icon: '',
                                        variable:
                                            'is_southern_federal_district',
                                    },
                                    {
                                        type: 'numberItem',
                                        title: 'Количество Федеральных образований',
                                        icon: '',
                                        variable: 'federal_entities',
                                    },
                                    {
                                        type: 'numberItem',
                                        title: 'Количество Субъектов Федерации',
                                        icon: '',
                                        variable: 'federal_subjects',
                                    },
                                    {
                                        type: 'numberItem',
                                        title: 'Количество Муниципальных образований',
                                        icon: '',
                                        variable: 'municipalities',
                                    },
                                    {
                                        type: 'numberItem',
                                        title: 'Количество кадастровых планов территории',
                                        icon: '',
                                        variable: 'cadastral_plan',
                                    },
                                    {
                                        type: 'numberItem',
                                        title: 'Количество сельских и городских поселений',
                                        icon: '',
                                        variable: 'settlements',
                                    },
                                    {
                                        type: 'numberItem',
                                        title: 'Объект располагается на территории Южного федерального округа',
                                        icon: '',
                                        variable:
                                            'is_southern_federal_district',
                                    },
                                    {
                                        type: 'numberItem',
                                        title: 'Количество подключений',
                                        icon: '',
                                        variable: 'connections',
                                    },
                                    {
                                        type: 'numberItem',
                                        title: 'Количество ЗОУИТ',
                                        icon: '',
                                        variable: 'ZOUIT_quantity',
                                    },
                                    {
                                        type: 'numberItem',
                                        title: 'Количество чертежей в томе 2',
                                        icon: '',
                                        variable: 'plot_volume_two',
                                    },
                                    {
                                        type: 'numberItem',
                                        title: 'Количество чертежей в томе 4',
                                        icon: '',
                                        variable: 'plot_volume_four',
                                    },
                                    {
                                        type: 'numberItem',
                                        title: 'Количество чертежей в томе 6',
                                        icon: '',
                                        variable: 'plot_volume_six',
                                    },
                                    {
                                        type: 'numberItem',
                                        title: 'Количество чертежей в томе 7',
                                        icon: '',
                                        variable: 'plot_volume_seven',
                                    },
                                    {
                                        type: 'numberItem',
                                        title: 'Количество проектов ДПТ',
                                        icon: '',
                                        variable: 'territory_projects',
                                    },
                                ],
                            },
                            {
                                type: 'stageItem',
                                title: 'СИД 2 этап. Логистическое обеспечение',
                                icon: '',
                                variable: 'idc_two_logistics',
                                child: [],
                                children: [
                                    {
                                        type: 'percentItem',
                                        title: '% выполнения работ собственными силамих',
                                        icon: '',
                                        variable: 'in_house_percentage',
                                    },
                                    {
                                        type: 'percentItem',
                                        title: '% выполнения работ субподряд',
                                        icon: '',
                                        variable: 'subcontracting_percentage',
                                    },
                                    {
                                        type: 'checkboxItem',
                                        title: 'Объект располагается на территории Южного федерального округа',
                                        icon: '',
                                        variable:
                                            'is_southern_federal_district',
                                    },
                                    {
                                        type: 'numberItem',
                                        title: 'Количество Федеральных образований',
                                        icon: '',
                                        variable: 'federal_entities',
                                    },
                                    {
                                        type: 'numberItem',
                                        title: 'Количество Субъектов Федерации',
                                        icon: '',
                                        variable: 'federal_subjects',
                                    },
                                    {
                                        type: 'numberItem',
                                        title: 'Количество Муниципальных образований',
                                        icon: '',
                                        variable: 'municipalities',
                                    },
                                    {
                                        type: 'numberItem',
                                        title: 'Количество кадастровых планов территории',
                                        icon: '',
                                        variable: 'cadastral_plan',
                                    },
                                    {
                                        type: 'numberItem',
                                        title: 'Количество сельских и городских поселений',
                                        icon: '',
                                        variable: 'settlements',
                                    },
                                    {
                                        type: 'numberItem',
                                        title: 'Объект располагается на территории Южного федерального округа',
                                        icon: '',
                                        variable:
                                            'is_southern_federal_district',
                                    },
                                ],
                            },
                            {
                                type: 'stageItem',
                                title: 'СИД 3 этап',
                                icon: '',
                                variable: 'idc_three',
                                child: [],
                                children: [
                                    {
                                        type: 'percentItem',
                                        title: '% выполнения работ собственными силамих',
                                        icon: '',
                                        variable: 'in_house_percentage',
                                    },
                                    {
                                        type: 'percentItem',
                                        title: '% выполнения работ субподряд',
                                        icon: '',
                                        variable: 'subcontracting_percentage',
                                    },
                                    {
                                        type: 'checkboxItem',
                                        title: 'Объект располагается на территории Южного федерального округа',
                                        icon: '',
                                        variable:
                                            'is_southern_federal_district',
                                    },
                                    {
                                        type: 'numberItem',
                                        title: 'Количество Федеральных образований',
                                        icon: '',
                                        variable: 'federal_entities',
                                    },
                                    {
                                        type: 'numberItem',
                                        title: 'Количество Субъектов Федерации',
                                        icon: '',
                                        variable: 'federal_subjects',
                                    },
                                    {
                                        type: 'numberItem',
                                        title: 'Количество Муниципальных образований',
                                        icon: '',
                                        variable: 'municipalities',
                                    },
                                    {
                                        type: 'numberItem',
                                        title: 'Количество кадастровых планов территории',
                                        icon: '',
                                        variable: 'cadastral_plan',
                                    },
                                    {
                                        type: 'numberItem',
                                        title: 'Количество сельских и городских поселений',
                                        icon: '',
                                        variable: 'settlements',
                                    },
                                    {
                                        type: 'numberItem',
                                        title: 'Объект располагается на территории Южного федерального округа',
                                        icon: '',
                                        variable:
                                            'is_southern_federal_district',
                                    },
                                    {
                                        type: 'numberItem',
                                        title: 'Количество подключений',
                                        icon: '',
                                        variable: 'connections',
                                    },
                                    {
                                        type: 'numberItem',
                                        title: 'Количество ЗОУИТ',
                                        icon: '',
                                        variable: 'ZOUIT_quantity',
                                        child: [],
                                        children: [],
                                    },
                                    {
                                        type: 'numberItem',
                                        title: 'Количество чертежей в томе 2',
                                        icon: '',
                                        variable: 'plot_volume_two',
                                    },
                                    {
                                        type: 'numberItem',
                                        title: 'Количество чертежей в томе 4',
                                        icon: '',
                                        variable: 'plot_volume_four',
                                    },
                                    {
                                        type: 'numberItem',
                                        title: 'Количество чертежей в томе 6',
                                        icon: '',
                                        variable: 'plot_volume_six',
                                    },
                                    {
                                        type: 'numberItem',
                                        title: 'Количество чертежей в томе 7',
                                        icon: '',
                                        variable: 'plot_volume_seven',
                                    },
                                    {
                                        type: 'numberItem',
                                        title: 'Количество проектов ДПТ',
                                        icon: '',
                                        variable: 'territory_projects',
                                    },
                                ],
                            },
                            {
                                type: 'stageItem',
                                title: 'Оформление прав на земельные участки',
                                icon: '',
                                variable: 'land_rights_registration',
                                child: [],
                                children: [
                                    {
                                        type: 'percentItem',
                                        title: '% выполнения работ собственными силамих',
                                        icon: '',
                                        variable: 'in_house_percentage',
                                    },
                                    {
                                        type: 'percentItem',
                                        title: '% выполнения работ субподряд',
                                        icon: '',
                                        variable: 'subcontracting_percentage',
                                    },
                                    {
                                        type: 'checkboxItem',
                                        title: 'Объект располагается на территории Южного федерального округа',
                                        icon: '',
                                        variable:
                                            'is_southern_federal_district',
                                    },
                                    {
                                        type: 'numberItem',
                                        title: 'Количество Субъектов Федерации',
                                        icon: '',
                                        variable: 'federal_subjects',
                                    },
                                    {
                                        type: 'numberItem',
                                        title: 'Количество Муниципальных образований',
                                        icon: '',
                                        variable: 'municipalities',
                                    },
                                    {
                                        type: 'numberItem',
                                        title: 'Площадь ',
                                        icon: '',
                                        variable: 'area',
                                    },
                                    {
                                        type: 'numberItem',
                                        title: 'Количество участков',
                                        icon: '',
                                        variable: 'land_plots_count',
                                        child: [],
                                        children: [],
                                    },
                                    {
                                        type: 'numberItem',
                                        title: 'Количество участков на землях ГЛФ',
                                        icon: '',
                                        variable: 'sff_land_plots_count',
                                    },
                                    {
                                        type: 'numberItem',
                                        title: 'Количество землепользователей',
                                        icon: '',
                                        variable: 'land_users',
                                    },
                                    {
                                        type: 'numberItem',
                                        title: 'Площадь на землях ГЛФ',
                                        icon: '',
                                        variable: 'sff_lands_area',
                                    },
                                    {
                                        type: 'numberItem',
                                        title: 'Протяженность',
                                        icon: '',
                                        variable: 'length',
                                    },
                                    {
                                        type: 'numberItem',
                                        title: 'Протяженность по землям ГЛФ',
                                        icon: '',
                                        variable: 'sff_lands_length',
                                    },
                                    {
                                        type: 'numberItem',
                                        title: 'Количество вариантов разрабатываемых по отдельным заданиям',
                                        icon: '',
                                        variable: 'variants_per_task',
                                    },
                                ],
                            },
                        ],
                    },
                },
            ],
        },
        // {
        //     type: "stepItem",
        //     title: "Уточненная стоимость (коэффициенты)",
        //     icon: 3,
        //     variable: "",
        //     children: [
        //         {
        //             type: "TitleItem",
        //             title: "Коэффициенты",
        //             icon: "",
        //             variable: ""
        //         },
        //         {
        //             type: "numberItem",
        //             title: "Коэффициент корректировки ПД/РД ОКС",
        //             icon: "",
        //             variable: ""
        //         },
        //         {
        //             type: "numberItem",
        //             title: "Коэффициент региона проектирования",
        //             icon: "",
        //             variable: "",
        //             child: [],
        //             children: []
        //         },
        //         {
        //             type: "numberItem",
        //             title: "Коэффициент усложняющих факторов",
        //             icon: "",
        //             variable: "",
        //             child: [],
        //             children: []
        //         },
        //         {
        //             type: "numberItem",
        //             title: "Коэффициент стоимости субподрядных работ",
        //             icon: "",
        //             variable: "",
        //             child: [],
        //             children: []
        //         },
        //     ]
        // },
        {
            type: 'stepItem',
            title: 'Дополнительные работы',
            icon: 3,
            variable: 'additionalWork',
            children: [
                {
                    type: 'ListWithAddAndRemove',
                    title: 'Вид работ',
                    icon: '',
                    variable: 'typeWork',
                    child: {
                        type: 'selectItemWithColleps',
                        title: 'Вид работ',
                        icon: '',
                        options: 'type_work',
                        variable: 'typeWork',
                        child: {
                            1: [
                                {
                                    type: 'percentItem',
                                    title: '% выполнения работ собственными силамих',
                                    icon: '',
                                    variable: 'performing_work_their_own',
                                },
                                {
                                    type: 'percentItem',
                                    title: '% выполнения работ субподряд',
                                    icon: '',
                                    variable: 'subcontracting_percentage',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Производительность',
                                    icon: '',
                                    variable: 'Performance',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Инфраструктура',
                                    icon: '',
                                    variable: 'infrastructure',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Прочее',
                                    icon: '',
                                    variable: 'other',
                                },
                            ],
                            2: [
                                {
                                    type: 'percentItem',
                                    title: '% выполнения работ собственными силамих',
                                    icon: '',
                                    variable: 'performing_work_their_own',
                                },
                                {
                                    type: 'percentItem',
                                    title: '% выполнения работ субподряд',
                                    icon: '',
                                    variable: 'subcontracting_percentage',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Производительность',
                                    icon: '',
                                    variable: 'performance',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Инфраструктура',
                                    icon: '',
                                    variable: 'infrastructure',
                                },
                                {
                                    type: 'numberItem',
                                    title: 'Прочее',
                                    icon: '',
                                    variable: 'other',
                                },
                            ],
                        },
                    },
                },
            ],
        },
    ],
};

export const objectTypes = [
    {
        label: 'Дожимная компрессорная станция (ДКС)',
        id: 'Дожимная компрессорная станция (ДКС)',
        children: [
            {
                type: 'checkboxItemGroup',
                title: '',
                icon: '',
                variable: 'structures',
                children: [
                    {
                        title: 'Ремонтно-механическая мастерская, Административно-бытовой корпус, Служебно-эксплуатационный блок, Производственно-эксплуатационный блок',
                        id: 'Ремонтно-механическая мастерская, Административно-бытовой корпус, Служебно-эксплуатационный блок, Производственно-эксплуатационный блок',
                    },
                    {
                        title: 'Котельная',
                        id: 'Котельная',
                    },
                    {
                        title: 'Механизированная мойка',
                        id: 'Механизированная мойка',
                    },
                    {
                        title: 'Канализационные очистные сооружения, водоочистные сооружения',
                        id: 'Канализационные очистные сооружения, водоочистные сооружения',
                    },
                    {
                        title: 'Закрытые одноэтажные стоянки автотранспорта площадью до 1500 м2.',
                        id: 'Закрытые одноэтажные стоянки автотранспорта площадью до 1500 м2.',
                    },
                ],
            },
            {
                type: 'selectItem',
                title: 'Вид агрегатов',
                icon: '',
                variable: 'aggregators',
                options: [
                    {
                        label: '1 агрегат',
                        id: '1 агрегат',
                    },
                    {
                        label: '2 агрегата',
                        id: '2 агрегата',
                    },
                    {
                        label: '3 агрегата',
                        id: '3 агрегата',
                    },
                    {
                        label: '4 агрегата',
                        id: '4 агрегата',
                    },
                    {
                        label: '5 агрегатов',
                        id: '5 агрегатов',
                    },
                    {
                        label: '6 агрегатов',
                        id: '6 агрегатов',
                    },
                    {
                        label: '7 агрегатов',
                        id: '7 агрегатов',
                    },
                    {
                        label: '8 агрегатов',
                        id: '8 агрегатов',
                    },
                    //, 2 агрегата, 3 агрегата, 4 агрегата, 5 агрегатов, 6 агрегатов, 7 агрегатов,
                ],
            },
        ],
    },
    {
        label: 'Компрессорная станция (КС)',
        id: 'Компрессорная станция (КС)',
        children: [
            {
                type: 'selectItem',
                title: 'Вид',
                icon: '',
                variable: 'capacity',
                options: [
                    {
                        label: '4х16 установленной мощностью, МВт и газотурбинным приводом',
                        id: '4х16 установленной мощностью, МВт и газотурбинным приводом',
                    },
                    {
                        label: '4х25 установленной мощностью, МВт и газотурбинным приводом',
                        id: '4х25 установленной мощностью, МВт и газотурбинным приводом',
                    },
                    {
                        label: '4х32 установленной мощностью, МВт и газотурбинным приводом',
                        id: '4х32 установленной мощностью, МВт и газотурбинным приводом',
                    },
                ],
            },
        ],
    },
    {
        label: 'Газораспределительная станция (ГРС) тех характеристики:',
        id: 'Газораспределительная станция (ГРС) тех характеристики:',
        children: [
            {
                type: 'selectItem',
                title: 'Вид',
                icon: '',
                variable: 'type',
                options: [
                    {
                        label: 'производительность до 150 тыс.м3/час',
                        id: 'производительность до 150 тыс.м3/час',
                    },
                    {
                        label: 'производительность свыше 150 тыс.м3/час',
                        id: 'производительность свыше 150 тыс.м3/час',
                    },
                ],
            },
        ],
    },
    {
        label: 'Волоконно-оптическая линия связи (ВОЛС) тех характеристики',
        id: 'Волоконно-оптическая линия связи (ВОЛС) тех характеристики',
        children: [
            {
                type: 'numberItem',
                title: 'Количество км',
                icon: '',
                variable: 'length',
            },
        ],
    },
    {
        label: 'Воздушная линия электропередачи (ВЛ), тех характеристики',
        id: 'Воздушная линия электропередачи (ВЛ), тех характеристики',
        children: [
            {
                type: 'numberItem',
                title: 'Количество км',
                icon: '',
                variable: 'length',
            },
        ],
    },
    {
        label: 'Подъездная автодорога (ПАД), тех характеристики',
        id: 'Подъездная автодорога (ПАД), тех характеристики',
        children: [
            {
                type: 'numberItem',
                title: 'Количество км',
                icon: '',
                variable: 'length',
            },
        ],
    },
    {
        label: 'Линейно-производственное управление магистральных газопроводов, тех характеристики',
        id: 'Линейно-производственное управление магистральных газопроводов, тех характеристики',
        children: [
            {
                type: 'numberItem',
                title: 'Количество км',
                icon: '',
                variable: 'length',
            },
        ],
    },
];

export default function Hoc(HocComponent) {
    class HocClass extends React.Component {
        render() {
            return <HocComponent {...this.props} />;
        }
    }
    return HocClass;
}
